AlanYANG0916/STC/STC1/STC1Dlg.cpp

// STC1Dlg.cpp : 实现文件
//

//声音相关

//#include <windows.h>
//#pragma comment(lib, "WINMM.LIB")

#include "stdafx.h"
#include "STC1.h"
#include "STC1Dlg.h"
#include "afxdialogex.h"
#include "Login.h"
#include "LoginSetPass.h"
#include "afxdialogex.h"
#include "DOFComm.h"
#include "math.h"
#include "mmsystem.h"
#include<ATLBASE.H>
#include<iomanip>
#include <io.h>

#include <hpdf.h>

#include "winsock.h"    
#include "mysql.h"  

#ifdef _DEBUG
#define new DEBUG_NEW
#endif

#pragma comment(lib,"libmysql.lib")//附加依赖项，也可以在工程属性中设置
#pragma comment(lib,"winmm.lib")//预编译静态链接库
#pragma comment(linker,"\"/manifestdependency:type='win32' name='Microsoft.Windows.Common-Controls' version='6.0.0.0' processorArchitecture='*' publicKeyToken='6595b64144ccf1df' language='*'\"")
#pragma comment(lib,"libhpdf.lib")//附加依赖项，也可以在工程属性中设置

#using "ModbusTCP.dll"
using namespace ModbusTCP;
using namespace System;
gcroot<TcpClient^> PLC = gcnew  TcpClient();

#include "SixDof.h"
//#include "MATRICDIV.h"
int  m_nCmd;
DataToDOF dd;

//全局变量
extern float single_move_speed_show[6];
extern double TTS_coordinate_value[7];
extern int IfMoveInPlace[6];//是否运动到位的标志
int ChairMode;//椅子的使用状态
bool REset;//先从负角度转到5.再回零的操作标志位
unsigned long int BufferStopCount = 0;
bool BufferStop = S_OFF;
extern float m_para[18];
extern float ref[6];
extern double ForZAxisCorr[6];
extern Translation translation;
UINT count0;     //主时钟计数器
Mode mode;
Sinmovetime sinmovetime;

extern TreatReportData m_report;
extern COLORREF ShowColor;
extern int m_radiogroup2;
extern BOOL PisOpen;//计划为打开的标志位
//extern int BeamNum;
//extern 	CString BeamName[20];//束流名称
//extern 	CString BeamTime[20];//束流应用时间
//extern 	CString BeamOper[20];//束流操作员
//extern 	double PlanBeamInfo[20][6];//束流位置的信息
//extern 	double ReBeamInfo[20][6];//真实位置的信息

extern CString permission;
extern CString UserName;

extern double M_COORD[6];
extern bool IsTreatMoving;//是否处于治疗状态运动
int DoingTreatMoving;//是否正在运动处于治疗状态运动
// 用于应用程序“关于”菜单项的 CAboutDlg 对话框

class CAboutDlg : public CDialogEx
{
public:
	CAboutDlg();

// 对话框数据
	enum { IDD = IDD_ABOUTBOX };

	protected:
	virtual void DoDataExchange(CDataExchange* pDX);    // DDX/DDV 支持

// 实现
protected:
	DECLARE_MESSAGE_MAP()
};

CAboutDlg::CAboutDlg() : CDialogEx(CAboutDlg::IDD)
{
}

void CAboutDlg::DoDataExchange(CDataExchange* pDX)
{
	CDialogEx::DoDataExchange(pDX);
}

BEGIN_MESSAGE_MAP(CAboutDlg, CDialogEx)
END_MESSAGE_MAP()


// CSTC1Dlg 对话框


CSTC1Dlg::CSTC1Dlg(CWnd* pParent /*=NULL*/)
	: CDialogEx(CSTC1Dlg::IDD, pParent)	
{
	m_hIcon = AfxGetApp()->LoadIcon(IDI_ICONLOGO);

	//m_pc2pc.Init(GetSafeHwnd());
	m_dof.Init(GetSafeHwnd());
	//this->SetDlgItemTextW(IDC_RAZ360EDIT, L"0");
	//this->SetDlgItemText(IDC_AZ360EDIT, L"0");
	//this->SetDlgItemTextW(IDC_AZ360EDIT, L"0");
	DOFInit();
	//ddd.IsCtrl2Pc = 0;
	count0 = 0;
	ChairMode = 0;
	for (int i = 0; i < 3; i++)//速度赋值
	{
		dd.Vxyz[i] = 0;
		dd.Axyz[i] = 0;
	}

	six_enable = false;
	EMSTOP = false;
	friststart = true;
	nMMTimer = 0;
	for (int i = 0; i<6; i++)
	{
		if (i<3)
		{
			single_move_speed_show[i] = 1;//运动速度赋值
		}
		else
		{
			single_move_speed_show[i] = 10;
		}
		userdata.eRR[i] = 0.f;//初始化userdata结构体
		userdata.m_force[i] = 0.f;
		userdata.m_eDOF[i] = 0.f;
		userdata.m_para[i] = 0;
		userdata.m_para[6 + i] = 0.1f;
		userdata.m_para[12 + i] = 0.f;
		attitude.mid[i] = 0.f;
		attitude.sen[i] = 0.f;
		IfMoveInPlace[i] = 1;
	}

	datachange.eX = 0;//初始化datachange结构体
	datachange.eY = 0;
	datachange.eZ = 0;
	datachange.eH = 0;
	datachange.eP = 0;
	datachange.eR = 0;
	datachange.eAx = 0;
	datachange.eAy = 0;
	datachange.eAz = 0;
	datachange.eVx = 0;
	datachange.eVy = 0;
	datachange.eVz = 0;
	sinmovetime.max = 1;
	sinmovetime.test = 0;
	mode.m_nAct = 0;
	m_nCmd = 255;
	userdata.total_send_do = 1;
	mode.m_nVarIdx = 0;


	lockflag = true;			//锁定标志
	enableflag = false;		//使能标志框
	EthLinkOK = false;
	Ret = 20;
	m_hJueDuiWeiZhi = "0";
	//fangxiang = 0;
	LR = false;
	CanUse = TRUE;
	REset = false;
	//EStop = false;

	maxtime = 0;
	IfMoveGet = false;
	for (size_t i = 0; i < 20; i++)
	{
		m_report.BeamName[i] = "1";
		m_report.BeamOper[i] = "null";
		m_report.BeamTime[i]="-1";
		m_report.PatientID = "123456";
		m_report.BeamAngle[i] = "-1";
	}
	DoingTreatMoving = 0;
}

void CSTC1Dlg::DoDataExchange(CDataExchange* pDX)
{
	CDialogEx::DoDataExchange(pDX);
	DDX_Control(pDX, IDC_TAB1, m_tab);

	DDX_Text(pDX, IDC_XEDIT, attitude.mid[0]);
	DDX_Text(pDX, IDC_YEDIT, attitude.mid[1]);
	DDX_Text(pDX, IDC_ZEDIT, attitude.mid[2]);
	DDX_Text(pDX, IDC_AXEDIT, attitude.mid[3]);
	DDX_Text(pDX, IDC_AYEDIT, attitude.mid[4]);
	DDX_Text(pDX, IDC_AZEDIT, attitude.mid[5]);

	DDX_Control(pDX, IDC_STARTBUTTON, m_Startcontrol);
	DDX_Control(pDX, IDC_EnBUTTON, m_Encontrol);
	DDX_Control(pDX, IDC_LockBUTTON, m_Lockcontrol);
	DDX_Control(pDX, IDC_EStopBUTTON, m_ESTOPcontrol);
}



BEGIN_MESSAGE_MAP(CSTC1Dlg, CDialogEx)
	ON_WM_SYSCOMMAND()
	ON_WM_PAINT()
	ON_WM_QUERYDRAGICON()
	ON_NOTIFY(TCN_SELCHANGE, IDC_TAB1, &CSTC1Dlg::OnTcnSelchangeTab1)
	ON_WM_TIMER()
	ON_BN_CLICKED(IDC_CTRLBUTTON, &CSTC1Dlg::OnBnClickedCtrlbutton)
	ON_BN_CLICKED(IDC_STARTBUTTON, &CSTC1Dlg::OnBnClickedStartbutton)
	ON_BN_CLICKED(IDC_RESETBUTTON, &CSTC1Dlg::OnBnClickedResetbutton)
	ON_BN_CLICKED(IDC_LockBUTTON, &CSTC1Dlg::OnBnClickedLockbutton)
	ON_BN_CLICKED(IDC_EStopBUTTON, &CSTC1Dlg::OnBnClickedEstopbutton)
	ON_BN_CLICKED(IDC_BUTTON6, &CSTC1Dlg::OnBnClickedButton6)
	ON_BN_CLICKED(IDC_BUTTON10, &CSTC1Dlg::OnBnClickedButton10)
	ON_BN_CLICKED(IDC_BUTTON9, &CSTC1Dlg::OnBnClickedButton9)
	ON_BN_CLICKED(IDC_EnBUTTON, &CSTC1Dlg::OnBnClickedEnbutton)
	ON_COMMAND(ID_32775, &CSTC1Dlg::On32775)
	ON_COMMAND(ID_SaveReport, &CSTC1Dlg::OnSavereport)
	ON_COMMAND(ID_SoftWareInfo, &CSTC1Dlg::OnSoftwareinfo)
	ON_COMMAND(ID_32780, &CSTC1Dlg::OnMenuExit)
	ON_COMMAND(ID_EDIT_RESETPASSWORD, &CSTC1Dlg::OnEditResetpassword)
	ON_BN_CLICKED(IDC_BUTTON13, &CSTC1Dlg::OnBnClickedButton13)
	ON_COMMAND(ID_INPUTPATIENT_ADDPATIENT, &CSTC1Dlg::OnInputpatientAddpatient)
	ON_COMMAND(ID_INPUTPATIENT_EDITPATIENT, &CSTC1Dlg::OnInputpatientEditpatient)
	ON_COMMAND(ID_INPUTPLAN_ADDPLAN, &CSTC1Dlg::OnInputplanAddplan)
	ON_COMMAND(ID_INPUTPLAN_EDITPLAN, &CSTC1Dlg::OnInputplanEditplan)
	ON_COMMAND(ID_USER_ADDUSER, &CSTC1Dlg::OnUserAdduser)
	ON_BN_CLICKED(IDC_movebeginBUTTON, &CSTC1Dlg::OnBnClickedmovebeginbutton)
END_MESSAGE_MAP()


// CSTC1Dlg 消息处理程序

BOOL CSTC1Dlg::OnInitDialog()
{
	CDialogEx::OnInitDialog();

