AlanYANG0916/STC/STC1/STC1Dlg.cpp
	// 将“关于...”菜单项添加到系统菜单中。

	// IDM_ABOUTBOX 必须在系统命令范围内。
	ASSERT((IDM_ABOUTBOX & 0xFFF0) == IDM_ABOUTBOX);
	ASSERT(IDM_ABOUTBOX < 0xF000);

	CMenu* pSysMenu = GetSystemMenu(FALSE);
	if (pSysMenu != NULL)
	{
		BOOL bNameValid;
		CString strAboutMenu;
		bNameValid = strAboutMenu.LoadString(IDS_ABOUTBOX);
		ASSERT(bNameValid);
		if (!strAboutMenu.IsEmpty())
		{
			pSysMenu->AppendMenu(MF_SEPARATOR);
			pSysMenu->AppendMenu(MF_STRING, IDM_ABOUTBOX, strAboutMenu);
		}
	}

	// 设置此对话框的图标。当应用程序主窗口不是对话框时，框架将自动
	//  执行此操作
	SetIcon(m_hIcon, TRUE);			// 设置大图标
	SetIcon(m_hIcon, FALSE);		// 设置小图标

	// TODO: 在此添加额外的初始化代码

	CLogin m_login;
	if (m_login.DoModal()==IDOK)
	{

	}
	else
	{
		CDialogEx::OnCancel();
		return FALSE;
	}

	//SetDlgItemText(IDD_STC1_DIALOG,);
	SetWindowText(L"RCTS v0.2   UserName: " + UserName + "  Permission: " + permission);
	menu.LoadMenu(IDR_MENU1);  //IDR_MENU1为菜单栏ID号  
	SetMenu(&menu);
	//menu.Detach();

		m_tab.InsertItem(0, L"Treatment Mode");  //添加参数一选项卡    
		m_tab.InsertItem(1, L"QA Mode");  //添加参数二选项卡   
		m_tab.InsertItem(2, L"Settings");    //添加结果选项卡
		m_mainui.Create(IDD_MAINDIALOG, GetDlgItem(IDD_STC1_DIALOG));
		m_cali.Create(IDD_CALIDIALOG, GetDlgItem(IDD_STC1_DIALOG));
		m_corr.Create(IDD_CORRDIALOG, GetDlgItem(IDD_STC1_DIALOG));

		if (permission == "3")
		{
			m_mainui.ShowWindow(true);
			m_cali.ShowWindow(false);
			m_corr.ShowWindow(false);
			this->GetDlgItem(IDC_TAB1)->EnableWindow(TRUE);
		}
		else if (permission == "2")
		{
			this->GetDlgItem(IDC_TAB1)->EnableWindow(TRUE);
		}
		else if (permission == "1")
		{
			m_mainui.ShowWindow(true);
			m_cali.ShowWindow(false);
			m_corr.ShowWindow(false);
			this->GetDlgItem(IDC_TAB1)->EnableWindow(FALSE);
		}


	CRect rs;    
	m_tab.GetClientRect(&rs);    
//调整子对话框在父窗口中的位置    
	rs.top+=1;     
	rs.bottom-=10;     
	rs.left+=300;    //520 
	rs.right+=500;  //540

//设置子对话框尺寸并移动到指定位置    
	m_mainui.MoveWindow(&rs);    
	m_cali.MoveWindow(&rs);    
	m_corr.MoveWindow(&rs); 
	m_mainui.ShowWindow(true);    
	m_cali.ShowWindow(false);    
	m_corr.ShowWindow(false); 
	m_tab.SetCurSel(0);

	ChangeUI();

	//m_hAccel = ::LoadAccelerators(AfxGetInstanceHandle(), MAKEINTRESOURCE(IDR_ACCELERATOR1));

	return TRUE;  // 除非将焦点设置到控件，否则返回 TRUE

	//DOFInit();//初始化六自由度平台解码对象
	
	//m_hAccel = ::LoadAccelerators(AfxGetInstanceHandle(), MAKEINTRESOURCE(IDR_ACCELERATOR1));
	//SetWindowPos(&wndTopMost, 0, 0, 0, 0,
		//SWP_NOMOVE | SWP_NOSIZE | SWP_NOACTIVATE);
	
}

void CSTC1Dlg::OnSysCommand(UINT nID, LPARAM lParam)
{
	if ((nID & 0xFFF0) == IDM_ABOUTBOX)
	{
		CAboutDlg dlgAbout;
		dlgAbout.DoModal();
	}
	else if (nID == SC_CLOSE)
	{
		if (ChairMode == TreatmentMode)
		{
			AfxMessageBox(_T("当前为治疗模式，若想关闭软件，请先结束治疗"));
			return;
		}
		if (IDYES == MessageBox(_T("Do you want to exit program？Please confirm that the current device is in a safe state"), _T("WARNING!"), MB_YESNO))
		{
			bool canclose=true;
			for (size_t i = 0; i < 6; i++)
			{
				if (abs(re_attitude_for_show[i]) > 1)
				{
					canclose = false;
				}
			}
			if (((m_dof.FromDOFBuf.nDOFStatus!= 55)&& (!canclose)&& EthLinkOK))
			{
				AfxMessageBox(_T("当前治疗椅状态不能关闭！"));
				return;
			}
			CString m_szFileName = L"./SettingsINI.ini";
			CString szKeyValue;
			szKeyValue.Format(L"%.0f", fangxiang);
			::WritePrivateProfileString(L"Open", L"fangxiang", szKeyValue.GetBuffer(MAX_PATH), m_szFileName);
			if (LR)
			{
				szKeyValue.Format(L"%d", 1);
				::WritePrivateProfileString(L"Open", L"LR", szKeyValue.GetBuffer(MAX_PATH), m_szFileName);
			}
			else
			{
				szKeyValue.Format(L"%d", 0);
				::WritePrivateProfileString(L"Open", L"LR", szKeyValue.GetBuffer(MAX_PATH), m_szFileName);
			}		
				EthLinkOK = false;
				enableflag = false;
				::timeKillEvent(nMMTimer);
				KillTimer(0);
				KillTimer(1);
				nMMTimer = 0;
				PLC->DeLink();
			CDialogEx::OnSysCommand(nID, lParam);
		}
	}
	else
	{
		CDialogEx::OnSysCommand(nID, lParam);
	}
}

// 如果向对话框添加最小化按钮，则需要下面的代码
//  来绘制该图标。对于使用文档/视图模型的 MFC 应用程序，
//  这将由框架自动完成。

void CSTC1Dlg::OnPaint()
{
	if (IsIconic())
	{
		CPaintDC dc(this); // 用于绘制的设备上下文

		SendMessage(WM_ICONERASEBKGND, reinterpret_cast<WPARAM>(dc.GetSafeHdc()), 0);

		// 使图标在工作区矩形中居中
		int cxIcon = GetSystemMetrics(SM_CXICON);
		int cyIcon = GetSystemMetrics(SM_CYICON);
		CRect rect;
		GetClientRect(&rect);
		int x = (rect.Width() - cxIcon + 1) / 2;
		int y = (rect.Height() - cyIcon + 1) / 2;

		// 绘制图标
		dc.DrawIcon(x, y, m_hIcon);
	}
	else
	{
		CDialogEx::OnPaint();
	}
	//ChangeUI();
}

//当用户拖动最小化窗口时系统调用此函数取得光标
//显示。
HCURSOR CSTC1Dlg::OnQueryDragIcon()
{
	return static_cast<HCURSOR>(m_hIcon);
}


void CSTC1Dlg::OnTcnSelchangeTab1(NMHDR *pNMHDR, LRESULT *pResult)
{
	if (ChairMode == TreatmentMode)
	{
		AfxMessageBox(_T("当前状态不允许切换至模式，如需要切换，请先结束当前治疗流程！"));
		return;
	}
	int CurSel = m_tab.GetCurSel();    
 switch(CurSel)    
{    
case 0:    
		ChairMode = NormalMode;
        m_mainui.ShowWindow(true);  
        m_cali.ShowWindow(false);    
		m_corr.ShowWindow(false);    
 break;    
 case 1:
	 if (permission == "1")
	 {
		 AfxMessageBox(_T("permission level 2or 3 should be needed！"));
		 return;
	 }
	 if (ChairMode == NormalMode)
	 {
		 ChairMode = QAMode;
		 m_mainui.ShowWindow(false);
		 m_cali.ShowWindow(true); m_cali.PostMessage(WM_COMMAND, MAKEWPARAM(IDC_BUTTON1, BN_CLICKED), NULL);
		 m_corr.ShowWindow(false);
	 }
	 else if (ChairMode == TreatmentMode)
	 {
		 CurSel = 0;
		 AfxMessageBox(_T("Can't to QAMode，please finish treatment workflow frist！"));
	 }
break;    
 case 2:
	 if (permission=="2"|| permission == "1")
	 {
		 AfxMessageBox(_T("permission level 3 should be needed！"));
		 return;
	 }
	 ChairMode = NormalMode;
	 if (ChairMode == NormalMode)
	 {
		 m_mainui.ShowWindow(false);
		 m_cali.ShowWindow(false);
		 m_corr.ShowWindow(true);
	 }
	 else if (ChairMode == TreatmentMode)
	 {
		 CurSel = 0;
		 AfxMessageBox(_T("Can't to Settings，please finish treatment workflow frist！"));
	 }
 break;    
 default:    
         ;    
    }  

	*pResult = 0;
}

BOOL CSTC1Dlg::PreTranslateMessage(MSG* pMsg)
{
	if (pMsg->message == WM_KEYDOWN)
	{
		switch (pMsg->wParam)
		{
			//case VK_RETURN: //屏蔽回车键
				//return TRUE;
		case VK_ESCAPE: //屏蔽ESC键
			return TRUE;
		default:
			break;
		}
	}


	if (m_hAccel)
	{
		if (::TranslateAccelerator(m_hWnd, m_hAccel, pMsg))
		{
			AfxMessageBox(_T("截到了Ctrl+C键"));
			::SendMessage(m_mainui.GetSafeHwnd(), WM_COMMAND, IDC_TREATMODEBUTTON, 0);
			return(TRUE);
		}
	}
	return CDialog::PreTranslateMessage(pMsg);
}

void CALLBACK TimeProc(UINT uTimerID, UINT uMsg, DWORD_PTR dwUser, DWORD_PTR dw1, DWORD_PTR dw2)//六自由度平台主计时器
{
	CSTC1Dlg *pDlg = (CSTC1Dlg*)dwUser;
	pDlg->timerout();
}

