AlanYANG0916/STC/STC1/STC1Dlg.cpp
void CSTC1Dlg::OnOK()
{}
void CSTC1Dlg::OnBnClickedStartbutton()//启动定时器,建立通信
{
	//PlaySound(_T("6531.wav"), NULL, SND_FILENAME | SND_ASYNC);
	//ChangeUI();
	//PLC连接，360°平台通信
	if (!EthLinkOK) {
		String ^LocalIP = gcnew String("192.168.0.131");
		String ^RemoteIP = gcnew String("192.168.0.101");
		Ret = PLC->EntLink(LocalIP, 0, RemoteIP, 502, "LICENCE@LFL20174516-MODBUSTCP-V2[969750209]");
		if (Ret == 0)//成功建立连接
		{
			EthLinkOK = true;
			m_Startcontrol.SetColor(BLACK, GREEN);
		}
		else
		{
			return;
		}
		//六自由度平台通信
		SetTimer(0, 20, NULL);
		nMMTimer = ::timeSetEvent(TIMER, 0, TimeProc, (LPARAM)this, TIME_PERIODIC);
		SetTimer(1, 100, NULL);
		SetDlgItemText(IDC_STARTBUTTON, L"Connected");
		this->GetDlgItem(IDC_EnBUTTON)->EnableWindow(TRUE);

		HICON m_hIcon = AfxGetApp()->LoadIcon(IDI_ICONGREEN);
		((CStatic*)GetDlgItem(IDC_CON_STA_STATIC))->SetIcon(m_hIcon);

		DWORD dwCopied = 0;
		CString szKeyValue;
		CString m_szFileName = L"./SettingsINI.ini";
		dwCopied = ::GetPrivateProfileString(L"Open", L"fangxiang", L"", szKeyValue.GetBuffer(MAX_PATH), MAX_PATH, m_szFileName);
		fangxiang = _wtof(szKeyValue.GetBuffer());
		szKeyValue.ReleaseBuffer();
		dwCopied = ::GetPrivateProfileString(L"Open", L"LR", L"", szKeyValue.GetBuffer(MAX_PATH), MAX_PATH, m_szFileName);
		if (_wtof(szKeyValue.GetBuffer())==1)
		{
			LR = TRUE;
		}
		else
		{
			LR = FALSE;
		}
		szKeyValue.ReleaseBuffer();
	}
	else
	{
		/*if (IDYES == MessageBox(_T("Determine to disconnect the device?please make sure "), _T("提示"), MB_YESNO))
		{
			EthLinkOK = false;
			enableflag = false;
			::timeKillEvent(nMMTimer);
			KillTimer(0);
			KillTimer(1);
			SetDlgItemText(IDC_STARTBUTTON, L"START");
			nMMTimer = 0;
			PLC->DeLink();
			m_Startcontrol.SetColor(BLACK, LLTGRAY);
			HICON m_hIcon = AfxGetApp()->LoadIcon(IDI_ICONGRAY);
			((CStatic*)GetDlgItem(IDC_CON_STA_STATIC))->SetIcon(m_hIcon);
			((CStatic*)GetDlgItem(IDC_EN_STA_STATIC))->SetIcon(m_hIcon);
			((CStatic*)GetDlgItem(IDC_LOCK_STA_STATIC))->SetIcon(m_hIcon);
			Sleep(2000);
			((CStatic*)GetDlgItem(IDC_OPE_STA_STATIC))->SetIcon(m_hIcon);
		}*/
	}
}


void CSTC1Dlg::timerout()
{
	float Kslow = 1;
	float re_attitude_for_show[6] = { 0 };//显示用姿态数组
	dd.nCheckID = 55;//m_dof.ToDOFBuf.nCheckID;
	dd.nAct = 0;//mode.m_nAct;
	dd.nCmd = m_nCmd;
	dd.nReserved = 1;//userdata.total_send_do;
					 //网络收的下位机状态，重点是电机的码值
	
	//m_nRecvCount = m_dof.nRecvCount;
	if (EMSTOP)
	{
		HICON m_hIcon = AfxGetApp()->LoadIcon(IDI_ICONRED);
		((CStatic*)GetDlgItem(IDC_OPE_STA_STATIC))->SetIcon(m_hIcon);
		SetDlgItemText(IDC_OPE_STATIC, L"Operating Status :Emergency Stop");
		this->GetDlgItem(IDC_LockBUTTON)->EnableWindow(FALSE);
		this->GetDlgItem(IDC_BUTTON6)->EnableWindow(FALSE);
		this->GetDlgItem(IDC_BUTTON9)->EnableWindow(FALSE);
		this->GetDlgItem(IDC_RESETBUTTON)->EnableWindow(FALSE);
		this->GetDlgItem(IDC_BUTTON10)->EnableWindow(FALSE);
		this->GetDlgItem(IDC_BUTTON13)->EnableWindow(FALSE);

		m_mainui.GetDlgItem(IDC_UPBUTTON)->EnableWindow(FALSE);
		m_mainui.GetDlgItem(IDC_DOWNBUTTON)->EnableWindow(FALSE);
		m_cali.GetDlgItem(IDC_CTRLBUTTON2)->EnableWindow(FALSE);
	}
	else if (!enableflag)
	{
		this->GetDlgItem(IDC_LockBUTTON)->EnableWindow(FALSE);
		this->GetDlgItem(IDC_BUTTON6)->EnableWindow(FALSE);
		this->GetDlgItem(IDC_BUTTON9)->EnableWindow(FALSE);
		this->GetDlgItem(IDC_RESETBUTTON)->EnableWindow(FALSE);
		this->GetDlgItem(IDC_BUTTON10)->EnableWindow(FALSE);
		this->GetDlgItem(IDC_BUTTON13)->EnableWindow(FALSE);

		m_mainui.GetDlgItem(IDC_UPBUTTON)->EnableWindow(FALSE);
		m_mainui.GetDlgItem(IDC_DOWNBUTTON)->EnableWindow(FALSE);
		m_cali.GetDlgItem(IDC_CTRLBUTTON2)->EnableWindow(FALSE);
	}
	else
	{
		if (ChairMode == NormalMode)
		{
			HICON m_hIcon = AfxGetApp()->LoadIcon(IDI_ICONGRAY);
			((CStatic*)GetDlgItem(IDC_MODE_STA_STATIC))->SetIcon(m_hIcon);
			SetDlgItemText(IDC_MODE_STATIC, L"Mode: Normal Mode");
		}
		if (ChairMode == QAMode)
		{
			HICON m_hIcon = AfxGetApp()->LoadIcon(IDI_ICONYELLOW);
			((CStatic*)GetDlgItem(IDC_POSLOCK_STA_STATIC))->SetIcon(m_hIcon);
			SetDlgItemText(IDC_POS_STATIC, L"Postrue Lock Status: QA Unlock");

			m_hIcon = AfxGetApp()->LoadIcon(IDI_ICONYELLOW);
			((CStatic*)GetDlgItem(IDC_MODE_STA_STATIC))->SetIcon(m_hIcon);
			SetDlgItemText(IDC_MODE_STATIC, L"Mode: QA Mode");

			m_cali.GetDlgItem(IDC_CTRLBUTTON2)->EnableWindow(TRUE);
		}
		if (ChairMode==TreatmentMode)
		{
			HICON m_hIcon = AfxGetApp()->LoadIcon(IDI_ICONGREEN);
			((CStatic*)GetDlgItem(IDC_OPE_STA_STATIC))->SetIcon(m_hIcon);
			SetDlgItemText(IDC_OPE_STATIC, L"Operating Status : Normal Working");
			this->GetDlgItem(IDC_RESETBUTTON)->EnableWindow(FALSE);
			this->GetDlgItem(IDC_BUTTON10)->EnableWindow(FALSE);
			this->GetDlgItem(IDC_BUTTON13)->EnableWindow(FALSE);
			m_mainui.GetDlgItem(IDC_UPBUTTON)->EnableWindow(FALSE);
			m_mainui.GetDlgItem(IDC_DOWNBUTTON)->EnableWindow(FALSE);

			((CStatic*)GetDlgItem(IDC_MODE_STA_STATIC))->SetIcon(m_hIcon);
			SetDlgItemText(IDC_MODE_STATIC, L"Mode: Treatment Mode");
		}		
		else if (m_dof.FromDOFBuf.nDOFStatus == 3)//正常工作态
		{
			HICON m_hIcon = AfxGetApp()->LoadIcon(IDI_ICONGREEN);
			((CStatic*)GetDlgItem(IDC_OPE_STA_STATIC))->SetIcon(m_hIcon);
			SetDlgItemText(IDC_OPE_STATIC, L"Operating Status : Normal Working");
			this->GetDlgItem(IDC_BUTTON6)->EnableWindow(FALSE);
			this->GetDlgItem(IDC_RESETBUTTON)->EnableWindow(TRUE);
			this->GetDlgItem(IDC_BUTTON10)->EnableWindow(TRUE);
			this->GetDlgItem(IDC_BUTTON13)->EnableWindow(TRUE);
			m_mainui.GetDlgItem(IDC_UPBUTTON)->EnableWindow(TRUE);
			m_mainui.GetDlgItem(IDC_DOWNBUTTON)->EnableWindow(TRUE);
		}
		else if (m_dof.FromDOFBuf.nDOFStatus == 1&& m_nCmd == 6)//正在升起
		{
			HICON m_hIcon = AfxGetApp()->LoadIcon(IDI_ICONYELLOW);
			((CStatic*)GetDlgItem(IDC_OPE_STA_STATIC))->SetIcon(m_hIcon);
			SetDlgItemText(IDC_OPE_STATIC, L"Operating Status : Rising");
			this->GetDlgItem(IDC_LockBUTTON)->EnableWindow(FALSE);
			this->GetDlgItem(IDC_BUTTON6)->EnableWindow(FALSE);
		}
		else if (m_dof.FromDOFBuf.nDOFStatus == 2)//准运行态
		{
			HICON m_hIcon = AfxGetApp()->LoadIcon(IDI_ICONYELLOW);
			((CStatic*)GetDlgItem(IDC_OPE_STA_STATIC))->SetIcon(m_hIcon);
			SetDlgItemText(IDC_OPE_STATIC, L"Operating Status :Quasi-Operational");
			OnBnClickedButton9();//开始运行
			//this->GetDlgItem(IDC_LockBUTTON)->EnableWindow(FALSE);
			//this->GetDlgItem(IDC_BUTTON6)->EnableWindow(FALSE);
		}
		else if (m_dof.FromDOFBuf.nDOFStatus == 2 && m_nCmd == 2)//复位中
		{
			HICON m_hIcon = AfxGetApp()->LoadIcon(IDI_ICONYELLOW);
			((CStatic*)GetDlgItem(IDC_OPE_STA_STATIC))->SetIcon(m_hIcon);
			SetDlgItemText(IDC_OPE_STATIC, L"Operating Status :Resetting");
			OnBnClickedButton9();//开始运行
								 //this->GetDlgItem(IDC_LockBUTTON)->EnableWindow(FALSE);
								 //this->GetDlgItem(IDC_BUTTON6)->EnableWindow(FALSE);
		}
		else if (m_dof.FromDOFBuf.nDOFStatus == 55&& lockflag)//下降到最低并且锁定
		{
			HICON m_hIcon = AfxGetApp()->LoadIcon(IDI_ICONYELLOW);
			((CStatic*)GetDlgItem(IDC_OPE_STA_STATIC))->SetIcon(m_hIcon);
			SetDlgItemText(IDC_OPE_STATIC, L"Operating Status : At The Lowest");
			GetDlgItemText(IDC_RAZ360EDIT, str);
			if (abs(_wtof(str.GetBuffer())+90)<2)
			{
				this->GetDlgItem(IDC_LockBUTTON)->EnableWindow(TRUE);
				this->GetDlgItem(IDC_EnBUTTON)->EnableWindow(TRUE);
			}
		}
		else if (m_dof.FromDOFBuf.nDOFStatus == 55 && !lockflag)//下降到最低但并非锁定锁定，就不能升起
		{
			HICON m_hIcon = AfxGetApp()->LoadIcon(IDI_ICONYELLOW);
			((CStatic*)GetDlgItem(IDC_OPE_STA_STATIC))->SetIcon(m_hIcon);
			SetDlgItemText(IDC_OPE_STATIC, L"Operating Status : At The Lowest");
			m_mainui.GetDlgItemText(IDC_RZEDIT2, str);
			if (abs(_wtof(str.GetBuffer()))<1 || abs(_wtof(str.GetBuffer()) - 360)<1)
			{
				this->GetDlgItem(IDC_LockBUTTON)->EnableWindow(TRUE);
				this->GetDlgItem(IDC_EnBUTTON)->EnableWindow(TRUE);
			}
		}
		else if (m_dof.FromDOFBuf.nDOFStatus == 0 && m_nCmd == 7)//正在下降
		{
			HICON m_hIcon = AfxGetApp()->LoadIcon(IDI_ICONYELLOW);
			((CStatic*)GetDlgItem(IDC_OPE_STA_STATIC))->SetIcon(m_hIcon);
			SetDlgItemText(IDC_OPE_STATIC, L"Operating Status : Going Down");
			this->GetDlgItem(IDC_LockBUTTON)->EnableWindow(FALSE);
			this->GetDlgItem(IDC_BUTTON6)->EnableWindow(FALSE);
			this->GetDlgItem(IDC_BUTTON9)->EnableWindow(FALSE);
			this->GetDlgItem(IDC_RESETBUTTON)->EnableWindow(FALSE);
			this->GetDlgItem(IDC_BUTTON10)->EnableWindow(FALSE);
			this->GetDlgItem(IDC_BUTTON13)->EnableWindow(FALSE);
			m_mainui.GetDlgItem(IDC_UPBUTTON)->EnableWindow(FALSE);
			m_mainui.GetDlgItem(IDC_DOWNBUTTON)->EnableWindow(FALSE);
		}

