AlanYANG0916/STC/STC1/STC1Dlg.cpp
		if (ChairMode == 0)
		{
			HICON m_hIcon = AfxGetApp()->LoadIcon(IDI_ICONGREEN);
			((CStatic*)GetDlgItem(IDC_POSLOCK_STA_STATIC))->SetIcon(m_hIcon);
			SetDlgItemText(IDC_POS_STATIC, L"Postrue Lock Status: normal");
		}
	}
	
	

	for (size_t i = 0; i < 18; i++)
	{
		userdata.m_para[i] = m_para[i];
	}

	if (m_dof.FromDOFBuf.nDOFStatus == 3)
	{
		this->GetDlgItem(IDC_BUTTON6)->EnableWindow(FALSE);
		this->GetDlgItem(IDC_LockBUTTON)->EnableWindow(FALSE);
	}

	if (m_dof.FromDOFBuf.nDOFStatus == 3 && dd.nCmd == S_CMD_Work)
	{
		this->GetDlgItem(IDC_CTRLBUTTON)->EnableWindow(TRUE);
		//this->GetDlgItem(IDC_BUTTON13)->EnableWindow(TRUE);
		this->GetDlgItem(IDC_RESETBUTTON)->EnableWindow(TRUE);
		//this->GetDlgItem(IDC_BUTTON10)->EnableWindow(TRUE);
	}

	if (m_dof.FromDOFBuf.nDOFStatus == 2 && dd.nCmd == S_CMD_Work)
	{
		this->GetDlgItem(IDC_CTRLBUTTON)->EnableWindow(TRUE);
	}

	if (m_dof.FromDOFBuf.nDOFStatus == 2 && dd.nCmd == S_CMD_Back2MID)
	{
		this->GetDlgItem(IDC_CTRLBUTTON)->EnableWindow(TRUE);
		this->GetDlgItem(IDC_BUTTON13)->EnableWindow(FALSE);
		this->GetDlgItem(IDC_RESETBUTTON)->EnableWindow(FALSE);
		this->GetDlgItem(IDC_BUTTON10)->EnableWindow(FALSE);
	}

	if (m_dof.FromDOFBuf.nDOFStatus == 55 && dd.nCmd == S_CMD_Stop)
	{
		this->GetDlgItem(IDC_CTRLBUTTON)->EnableWindow(TRUE);
		if (enableflag)
		{
			this->GetDlgItem(IDC_BUTTON6)->EnableWindow(TRUE);
		}
		
		//this->GetDlgItem(IDC_LockBUTTON)->EnableWindow(TRUE);
	}

	if (m_dof.FromDOFBuf.nDOFStatus == 55 && dd.nCmd == S_CMD_RUN)
	{
		//this->GetDlgItem(IDC_WORK)->EnableWindow(TRUE);
		//this->GetDlgItem(IDC_RUN)->EnableWindow(FALSE);
		//this->GetDlgItem(IDC_TOMID)->EnableWindow(FALSE);
		//this->GetDlgItem(IDC_STOP)->EnableWindow(FALSE);
	}

	//有回中位命令时，所有参数进行初始化||(m_nCmd==S_CMD_ChaConf)
	if ((m_nCmd == S_CMD_Back2MID) || (m_nCmd == S_CMD_Work) || (m_nCmd == S_CMD_Stop))
	{
		for (int i = 0; i<6; i++)
		{
			dd.DOFs[i] = 0.f;
			userdata.m_para[i] = 0.f;
			userdata.m_para[i + 6] = 0.f;
			attitude.mid[i] = 0.f;
			attitude.end[i] = 0.f;
			attitude.sen[i] = 0.f;
		}
		datachange.eR = 0;
		datachange.eP = 0;
		datachange.eH = 0;
		datachange.eX = 0;
		datachange.eY = 0;
		datachange.eZ = 0;
		count0 = 0;
		count1 = 0;
		mode.flag_count = F_None;
		onoff.set_button = S_ON;
		onoff.back2mid = S_OFF;
	}

	switch (mode.flag_count) //平台正常运行模式
	{
	case F_SinMove://单步运动
		UINT ACOUNT;
		float abs_tattitude[6];
		ACOUNT = 0;
		count0++;
		for (int i = 0; i < 6; i++)
		{
			abs_tattitude[i] = fabs((attitude.end[i] - attitude.mid[i])*60000.f) / 10000.f;//过渡
			if (i < 3)
			{
				if (ACOUNT <= PI / (single_move_speed[i] / (abs_tattitude[i] / 2.f))*(1000.f / TIMER))
					ACOUNT = PI / (single_move_speed[i] / (abs_tattitude[i] / 2.f))*(1000.f / TIMER);
			}
			else
			{
				if (ACOUNT <= PI / (single_move_speed[i] / (abs_tattitude[i] / 2.f))*(1000.f / TIMER))
					ACOUNT = PI / (single_move_speed[i] / (abs_tattitude[i] / 2.f))*(1000.f / TIMER);
			}
		}

		if (count0 <= ACOUNT)//表示还在运动过程中
		{
			for (int i = 0; i < 6; i++)
			{
				if (i < 3)
				{
					if (count0 <= PI / (single_move_speed[i] / (abs_tattitude[i] / 2.f))*(1000.f / TIMER))
					{
						attitude.sen[i] = ((attitude.end[i] / 2.f) + (attitude.end[i] / 2.f)*cos(single_move_speed[i] / (abs_tattitude[i] / 2.f)*count0 / (1000.f / TIMER)));
						attitude.sen[i] = attitude.sen[i] + ((attitude.mid[i] / 2.f) - (attitude.mid[i] / 2.f)*cos(single_move_speed[i] / (abs_tattitude[i] / 2.f)*count0 / (1000.f / TIMER)));
					}
				}
				else
				{
					if (count0 <= PI / (single_move_speed[i] / (abs_tattitude[i] / 2.f))*(1000.f / TIMER))
					{
						attitude.sen[i] = ((attitude.end[i] / 2.f) + (attitude.end[i] / 2.f)*cos(single_move_speed[i] / (abs_tattitude[i] / 2.f)*count0 / (1000.f / TIMER)));
						attitude.sen[i] = attitude.sen[i] + ((attitude.mid[i] / 2.f) - (attitude.mid[i] / 2.f)*cos(single_move_speed[i] / (abs_tattitude[i] / 2.f)*count0 / (1000.f / TIMER)));
					}
				}
			}
		}//运动结束
		else
		{
			for (int i = 0; i < 6; i++)
			{
				attitude.sen[i] = attitude.mid[i];
			}
			//判断是否运动到位			
		}
		//if (JudgeAction())
		//{
			//ShowColor = RGB(0, 255, 0);//AfxMessageBox(_T("已运动到位！"));
		//}
		break;

	case F_SinMotion://单轴正弦运动
		if (count0<2000)
			Kslow = count0 / 2000.0;
		else if (count0<(sinmovetime.max + 20) * 100)
			Kslow = 1;
		else if (count0 >= (sinmovetime.max + 20) * 100 && count0 <= ((sinmovetime.max + 20) * 100 + 2000))
			Kslow = (sinmovetime.max * 100 + 4000 - count0) / 2000.0;
		else
		{
			//GetDlgItem(IDC_STOPSINMOVE)->EnableWindow(FALSE);
			//this->GetDlgItem(IDC_STARTSINMOVE)->EnableWindow(TRUE);
			Kslow = 0;
		}
		if (BufferStop == S_ON)
		{
			if ((count0 - BufferStopCount)<1000)
				Kslow = Kslow*(1 - (count0 - BufferStopCount) / 1000.0);
			else
			{
				Kslow = 0;
				//this->GetDlgItem(IDC_STARTSINMOVE)->EnableWindow(TRUE);
				//this->GetDlgItem(IDC_STOPSINMOVE)->EnableWindow(FALSE);
			}

		}

		if (Kslow>1) Kslow = 1;
		if (Kslow<0) Kslow = 0;

		datachange.eR = Kslow*userdata.m_para[0] * sin(6.283*(userdata.m_para[6] * count0*TIMER / 1000.f + userdata.m_para[12] / 360.f));
		datachange.eP = Kslow*userdata.m_para[1] * sin(6.283*(userdata.m_para[7] * count0*TIMER / 1000.f + userdata.m_para[13] / 360.f));
		datachange.eH = Kslow*userdata.m_para[2] * sin(6.283*(userdata.m_para[8] * count0*TIMER / 1000.f + userdata.m_para[14] / 360.f));
		datachange.eX = Kslow*userdata.m_para[3] * sin(6.283*(userdata.m_para[9] * count0*TIMER / 1000.f + userdata.m_para[15] / 360.f));
		datachange.eY = Kslow*userdata.m_para[4] * sin(6.283*(userdata.m_para[10] * count0*TIMER / 1000.f + userdata.m_para[16] / 360.f));
		datachange.eZ = Kslow*userdata.m_para[5] * sin(6.283*(userdata.m_para[11] * count0*TIMER / 1000.f + userdata.m_para[17] / 360.f));
		count0++;

		sinmovetime.test -= 0.01;
		if (sinmovetime.test<0) sinmovetime.test = 0;
		break;

	}


	if (mode.flag_count == F_SinMove)
	{
		for (int i = 0; i<6; i++)
		{
			if (i<3)
				dd.DOFs[i] = attitude.sen[i];
			else
				dd.DOFs[i] = attitude.sen[i] / 1000.f;
		}
	}
	else
	{
		dd.DOFs[0] = datachange.eR;
		dd.DOFs[1] = datachange.eP;
		dd.DOFs[2] = datachange.eH;
		dd.DOFs[3] = datachange.eX / 1000.f;
		dd.DOFs[4] = datachange.eY / 1000.f;
		dd.DOFs[5] = datachange.eZ / 1000.f;
	}

	m_dof.SendData(&dd);
}

void CSTC1Dlg::OnBnClickedCtrlbutton()//控制治疗椅的移动
{
	translation.Offset[3] = M_COORD[3];
	translation.Offset[4] = M_COORD[4];
	translation.Offset[5] = M_COORD[5];

	CString m_hJueDuiSuduSet = L"240";//20°每10秒
									  //360°平台的控制
									  //CString m_hJueDuiWeiZhi;
	GetDlgItemText(IDC_AZ360EDIT, m_hJueDuiWeiZhi);
	//int m_hJueDuiWei = _ttof(m_hJueDuiWeiZhi)*100;
	//CString m_hJueDuiWeiZhiSet;
	//m_hJueDuiWeiZhiSet.Format(L"%d", m_hJueDuiWei);
	//CString m_hJueDuiWeiZhiSet = m_hJueDuiWeiZhi + "00";
	CString m_hJueDuiWeiZhiSet;
	m_hJueDuiWeiZhiSet.Format(L"%.2f", _wtof(m_hJueDuiWeiZhi.GetBuffer()) * 100);
	CString m_hJueDuiWeiZhiH = ToHdata(m_hJueDuiWeiZhiSet);
	CString m_hJueDuiWeiZhiL = ToLdata(m_hJueDuiWeiZhiSet);

	cli::array<Object ^>^ bRD = gcnew cli::array<Object ^>(3);
	String^ JueDuiSuduSet = gcnew String(m_hJueDuiSuduSet.GetBuffer(0));
	String^ JueDuiWeiZhiH = gcnew String(m_hJueDuiWeiZhiH.GetBuffer(0));
	String^ JueDuiWeiZhiL = gcnew String(m_hJueDuiWeiZhiL.GetBuffer(0));

	bRD[0] = JueDuiSuduSet;//定义速度（10°每10s）
	bRD[1] = JueDuiWeiZhiL;
	bRD[2] = JueDuiWeiZhiH;
	if (enableflag)
	{

		// 在此调用Button按钮按下的操作
		//short Ret;
		Ret = PLC->CmdWrite(ModbusTCP::TcpClient::PlcMemory::HR, ModbusTCP::TcpClient::DataType::INT16, 4510, 3, bRD); //写PLC D414 D415 D416的数据
		if (Ret != 0)
		{
			//MessageBox(L"通信异常1！");
			return;
		}
		if (m_hJueDuiWeiZhi.Left(1) == "-")
		{
			Ret = PLC->Bit_Set(ModbusTCP::TcpClient::PlcMemory::DQ, 2052, 0);//置位PLC M4线圈
			if (Ret != 0)
			{
				//MessageBox(L"通信异常2！");
				return;
			}
		}
		else
		{
			Ret = PLC->Bit_Set(ModbusTCP::TcpClient::PlcMemory::DQ, 2051, 0);//置位PLC M3线圈
			if (Ret != 0)
			{
				//MessageBox(L"通信异常3！");
				return;
			}
		}
	}
	else
	{
		//MessageBox(L"系统未使能！");
		return;
	}
	delete bRD;
	delete JueDuiWeiZhiH;
	delete JueDuiWeiZhiL;
	delete JueDuiSuduSet;

	if (enableflag)
	{
		//ddd.IsCtrl2Pc = 2;
		count0 = 0;
		mode.flag_count = F_SinMove;

		for (int i = 0; i < 3; i++)
		{
			attitude.end[i] = dd.DOFs[i];
		}
		for (int i = 3; i < 6; i++)
		{
			attitude.end[i] = dd.DOFs[i] * 1000.f;
		}
		for (size_t i = 0; i < 6; i++)
		{
			speed[i] = attitude.mid[i];
		}
		UpdateData(TRUE);//用控件中的值更新对应的变量值

