AlanYANG0916/STC/STC1/STC1Dlg.cpp
		if (ChairMode == TreatmentMode)
		{
			//DoingTreatMoving = 0;
			CtrlSpeed();
		}

		GetXYCORRData(attitude.mid);
		
		for (int i = 0; i < 3; i++)
		{
			if (attitude.mid[i] >= 20.f)//软件限位
			{
				attitude.mid[i] = 20.0f;
			}
			else if (attitude.mid[i] <= -20.f)//软件限位
			{
				attitude.mid[i] = -20.f;
			}

			if (ChairMode==NormalMode||ChairMode == TreatmentMode)//QA模式下不限速
			{
				if (single_move_speed_show[i] >= 1.f)//软件限速
				{
					single_move_speed_show[i] = 1.f;
				}
				else if (single_move_speed_show[i] <= 0.1f)//软件限速
				{
					single_move_speed_show[i] = 0.1f;
				}
			}
		}

		for (int i = 3; i < 6; i++)
		{
			if (attitude.mid[i] >= 200.f)
			{
				attitude.mid[i] = 200.f;
			}
			else if (attitude.mid[i] <= -200.f)
			{
				attitude.mid[i] = -200.f;
			}

			if (ChairMode == NormalMode || ChairMode == TreatmentMode)//在QA模式下不限速
			{
				if (single_move_speed_show[i] >= 10.f)
				{
					single_move_speed_show[i] = 10.f;
				}
				else if (single_move_speed_show[i] <= 0.1f)
				{
					single_move_speed_show[i] = 0.1f;
				}
			}
		}

		UpdateData(FALSE);//用变量的值更新控件上显示的数值

		for (int i = 0; i < 6; i++)
		{
			single_move_speed[i] = single_move_speed_show[i] * 3 * PI;
		}
	}
}

void CSTC1Dlg::OnBnClickedButton6()//初始化
{
	if (IDYES == MessageBox(_T("Determine to lift the device?"), _T("Notice"), MB_YESNO))
	{
		//六自由度平台
		m_nCmd = 6;
		Sleep(1000);
		this->GetDlgItem(IDC_BUTTON6)->EnableWindow(FALSE);
		this->GetDlgItem(IDC_BUTTON9)->EnableWindow(TRUE);
		this->GetDlgItem(IDC_LockBUTTON)->EnableWindow(FALSE);
	}
}


void CSTC1Dlg::OnBnClickedButton10()//平台落下
{
	if (IDYES == MessageBox(_T("Determine to stop the current running state and stop the device?"), _T("Notice"), MB_YESNO))
	{
		m_tab.SetCurSel(0);
		m_mainui.ShowWindow(true);
		m_cali.ShowWindow(false);
		m_corr.ShowWindow(false);
		m_tab.EnableWindow(FALSE);
		m_mainui.GetDlgItem(IDC_UPBUTTON)->EnableWindow(FALSE); m_mainui.GetDlgItem(IDC_DOWNBUTTON)->EnableWindow(FALSE); 
		m_mainui.GetDlgItem(IDC_TREATMODEBUTTON)->EnableWindow(FALSE);
		//m_mainui.ShowWindow(TRUE); m_.ShowWindow(TRUE); m_mainui.ShowWindow(TRUE);
		SetDlgItemTextW(IDC_AZ360EDIT, L"-90");
		OnBnClickedCtrlbutton();

		this->GetDlgItem(IDC_BUTTON10)->EnableWindow(FALSE);
		//this->GetDlgItem(IDC_BUTTON6)->EnableWindow(TRUE);
		this->GetDlgItem(IDC_BUTTON9)->EnableWindow(FALSE);
		this->GetDlgItem(IDC_RESETBUTTON)->EnableWindow(FALSE);
		//this->GetDlgItem(IDC_STOPBUTTON)->EnableWindow(FALSE);
		this->GetDlgItem(IDC_CTRLBUTTON)->EnableWindow(FALSE);
		this->GetDlgItem(IDC_BUTTON13)->EnableWindow(FALSE);
	
		m_nCmd = 7;
		ChairMode = NormalMode;

	}
}


void CSTC1Dlg::OnBnClickedButton9()//开始运行
{
	//if (IDYES == MessageBox(_T("Determine to start the  running state?"), _T("提示"), MB_YESNO))
	//{
		if ((m_dof.FromDOFBuf.nDOFStatus == 2) || (m_dof.FromDOFBuf.nDOFStatus == 3))
		{
			CanUse = TRUE;
			this->GetDlgItem(IDC_RESETBUTTON)->EnableWindow(TRUE);
			this->GetDlgItem(IDC_BUTTON10)->EnableWindow(TRUE);
			this->GetDlgItem(IDC_CTRLBUTTON)->EnableWindow(TRUE);

			m_tab.EnableWindow(TRUE);
			m_mainui.GetDlgItem(IDC_UPBUTTON)->EnableWindow(TRUE); m_mainui.GetDlgItem(IDC_DOWNBUTTON)->EnableWindow(TRUE);
			m_mainui.GetDlgItem(IDC_TREATMODEBUTTON)->EnableWindow(TRUE);
			this->GetDlgItem(IDC_BUTTON9)->EnableWindow(FALSE);
			this->GetDlgItem(IDC_TAB1)->EnableWindow(TRUE);
			this->GetDlgItem(IDC_EStopBUTTON)->EnableWindow(TRUE);
			this->GetDlgItem(IDC_BUTTON13)->EnableWindow(TRUE);
			m_nCmd = 0;
		}
		else
		{
			MessageBox(L"设备尚未准备完成，请等待!");
		}
	//}
}

void CSTC1Dlg::OnBnClickedResetbutton()//复位
{
	if (IDYES == MessageBox(_T("Determine to stop the current running state and reset the device ? The device will go back to the run ready location"), _T("Notice"), MB_YESNO))
	{
		CanUse = false;
		//LR = false;
		m_nCmd = 2;
		m_dof.ToNeutral();
		for (int i = 0; i < 6; i++)
		{
			attitude.mid[i] = 0;
		}
		UpdateData(false);
		this->GetDlgItem(IDC_BUTTON13)->EnableWindow(FALSE);
		this->GetDlgItem(IDC_EStopBUTTON)->EnableWindow(TRUE);
		this->GetDlgItem(IDC_BUTTON10)->EnableWindow(FALSE);
		this->GetDlgItem(IDC_RESETBUTTON)->EnableWindow(FALSE);

		/*CString m_hShiJiJiaoDu;
		double ang = 0;
		GetDlgItem(IDC_RAZ360EDIT)->GetWindowTextW(m_hShiJiJiaoDu);
		//m_hShiJiJiaoDu.Format(_T("4%f"), ang);
		ang = _wtof(m_hShiJiJiaoDu.GetBuffer());
		if (ang >5)//当位置大于5才能执行归零操作
		{
			if (EthLinkOK)
			{
				fangxiang = 0;
				cli::array<Object ^>^ bRD = gcnew cli::array<Object ^>(1);
				String^ StrReg = gcnew String("");
				if (enableflag)
				{
					//fangxiang = 0;
					//short Ret = 254;
					Ret = PLC->Bit_Set(ModbusTCP::TcpClient::PlcMemory::DQ, 2050, 0); //设置PLC M2线圈置位
					if (Ret != 0)
					{
						MessageBox(L"座椅归零故障！");
						return;
					}
					Ret = PLC->CmdRead(ModbusTCP::TcpClient::PlcMemory::HR, ModbusTCP::TcpClient::DataType::INT16, 4098, 1, bRD); //读PLC D2的数据，3535表示正常
					if (Ret == 0)
					{
						StrReg = bRD[0]->ToString();
						if (StrReg != "3535")
						{
							MessageBox(L"座椅归零读取数据故障！");
							return;
						}
						else
						{
							this->SetDlgItemTextW(IDC_AZ360EDIT, L"0");
						}
					}
					else
					{
						MessageBox(L"座椅归零读取数据异常！");
					}
				}
				else
				{
					MessageBox(L"系统未使能！");
				}
				delete bRD;
				delete StrReg;
			}
			else
			{
				MessageBox(L"PLC未连接");
			}
		}*/
	}
}

void CSTC1Dlg::OnBnClickedEstopbutton()
{
	if (EMSTOP == false)
	{
		if (!enableflag)
		{
			return;
		}
		EMSTOP = true;
		m_ESTOPcontrol.SetColor(BLACK,RED);
		//this->GetDlgItem(IDC_EStopBUTTON)->EnableWindow(FALSE);
		this->GetDlgItem(IDC_LockBUTTON)->EnableWindow(FALSE);
		this->GetDlgItem(IDC_BUTTON6)->EnableWindow(FALSE);
		this->GetDlgItem(IDC_BUTTON9)->EnableWindow(FALSE);
		this->GetDlgItem(IDC_RESETBUTTON)->EnableWindow(FALSE);
		this->GetDlgItem(IDC_BUTTON10)->EnableWindow(FALSE);
		this->GetDlgItem(IDC_BUTTON13)->EnableWindow(FALSE);
		this->GetDlgItem(IDC_EnBUTTON)->EnableWindow(FALSE);

		/*cli::array<Object ^>^ bRD = gcnew cli::array<Object ^>(1);
		String^ StrReg = gcnew String("");
		Ret = PLC->Bit_Set(ModbusTCP::TcpClient::PlcMemory::DQ, 2053, 0); //设置PLC M5线圈开
		if (Ret != 0)
		{
			MessageBox(L"停止故障！");
			return;
		}
		m_Lockcontrol.SetColor(BLACK, LTGRAY);
		lockflag = false;
		enableflag = false;
		m_Encontrol.SetColor(BLACK, LTGRAY);*/

		float re_attitude_for_show[6] = { 0 };

		for (int i = 0; i<6; i++)
		{
			re_attitude_for_show[i] = m_dof.FromDOFBuf.motor_code[i];//回传码值
		}
		//码值转换为六维度的分量
		m_dof.FromDOFBuf.motor_code[0] = re_attitude_for_show[4];//userdata.m_eDOF[4];
		m_dof.FromDOFBuf.motor_code[1] = re_attitude_for_show[5];//userdata.m_eDOF[5];
		m_dof.FromDOFBuf.motor_code[2] = re_attitude_for_show[0];
		m_dof.FromDOFBuf.motor_code[3] = re_attitude_for_show[1];
		m_dof.FromDOFBuf.motor_code[4] = re_attitude_for_show[2];//userdata.m_eDOF[2];
		m_dof.FromDOFBuf.motor_code[5] = re_attitude_for_show[3];//userdata.m_eDOF[3];

																 //解码
		SoluteAttitude(m_dof.FromDOFBuf.motor_code, re_attitude_for_show);
		//后三位需要乘以1000
		for (int i = 3; i < 6; i++)
		{
			re_attitude_for_show[i] = re_attitude_for_show[i] * 1000;
		}
		//将数值显示
		str.Format(L"%.2f", re_attitude_for_show[0]); this->SetDlgItemTextW(IDC_XEDIT, str);
		str.Format(L"%.2f", re_attitude_for_show[1]); this->SetDlgItemTextW(IDC_YEDIT, str);
		str.Format(L"%.2f", re_attitude_for_show[2]); this->SetDlgItemTextW(IDC_ZEDIT, str);
		str.Format(L"%.2f", re_attitude_for_show[3]); this->SetDlgItemTextW(IDC_AXEDIT, str);
		str.Format(L"%.2f", re_attitude_for_show[4]); this->SetDlgItemTextW(IDC_AYEDIT, str);
		str.Format(L"%.2f", re_attitude_for_show[5]); this->SetDlgItemTextW(IDC_AZEDIT, str);

		count0 = 0;
		mode.flag_count = F_SinMove;

		for (int i = 0; i<3; i++)
		{
			attitude.end[i] = dd.DOFs[i];
		}
		for (int i = 3; i<6; i++)
		{
			attitude.end[i] = dd.DOFs[i] * 1000.f;
		}

		UpdateData(TRUE);//用控件中的值更新对应的变量值
		for (int i = 0; i<3; i++)
		{
			if (attitude.mid[i] >= 20.f)//软件限位
			{
				attitude.mid[i] = 20.0f;
			}
			else if (attitude.mid[i] <= -20.f)//软件限位
			{
				attitude.mid[i] = -20.f;
			}

			if (single_move_speed_show[i] >= 2)//软件限速
			{
				single_move_speed_show[i] = 2;
			}
			else if (single_move_speed_show[i] <= 0.1)//软件限速
			{
				single_move_speed_show[i] = 0.1f;
			}
		}

		for (int i = 3; i<6; i++)
		{
			if (attitude.mid[i] >= 200.f)
			{
				attitude.mid[i] = 200.f;
			}
			else if (attitude.mid[i] <= -200.f)
			{
				attitude.mid[i] = -200.f;
			}

			if (single_move_speed_show[i] >= 10.f)
			{
				single_move_speed_show[i] = 10.f;
			}
			else if (single_move_speed_show[i] <= 0.1f)
			{
				single_move_speed_show[i] = 0.1f;
			}
		}
		UpdateData(FALSE);//用变量的值更新控件上显示的数值

		for (int i = 0; i<6; i++)
		{
			single_move_speed[i] = single_move_speed_show[i] * 3 * PI;
		}
		OnBnClickedEnbutton();
		SetDlgItemText(IDC_EStopBUTTON, L"Em-stop\nRecovery");
	}
	else if (EMSTOP==true)
	{
		//EMSTOP = false;
		this->GetDlgItem(IDC_EnBUTTON)->EnableWindow(TRUE);
		m_ESTOPcontrol.SetColor(BLACK,LTGRAY);
		OnBnClickedEnbutton();
		SetDlgItemText(IDC_EStopBUTTON, L"Emergency\nStop");
		
