AlanYANG0916/STC/STC1/STC1Dlg.cpp
	}

	//m_pc2pc.IsCtrl2Pc=false;
}

void CSTC1Dlg::OnBnClickedEnbutton()//使能开关
{
	if (EthLinkOK)//是否连接
	{
		cli::array<Object ^>^ bRD = gcnew cli::array<Object ^>(1);
		String^ StrReg = gcnew String("");
		if (!enableflag)
		{
			Ret = PLC->Bit_Set(ModbusTCP::TcpClient::PlcMemory::DQ, 2048, 0); //设置PLC M0线圈开
			if (Ret != 0)
			{
				MessageBox(L"使能故障1！");
				return;
			}
			Ret = PLC->CmdRead(ModbusTCP::TcpClient::PlcMemory::HR, ModbusTCP::TcpClient::DataType::INT16, 4096, 1, bRD); //读PLC D0的数据，1515表示正常
			if (Ret == 0)
			{
				StrReg = bRD[0]->ToString();
				if (StrReg != "1515")
				{
					MessageBox(L"使能故障2！");
					return;
				}
				else
				{
					//if (friststart)
					//{
						//friststart = false;
						//this->GetDlgItem(IDC_BUTTON6)->EnableWindow(TRUE);
						GetDlgItemText(IDC_RAZ360EDIT, str);
						this->SetDlgItemTextW(IDC_AZ360EDIT, str);
					m_Encontrol.SetColor(BLACK, GREEN);
					this->GetDlgItem(IDC_EStopBUTTON)->EnableWindow(TRUE);
					//this->GetDlgItem(IDC_LockBUTTON)->EnableWindow(TRUE);
					SetDlgItemText(IDC_EnBUTTON, L"Close En");
					enableflag = true;
					if (EMSTOP)
					{
						this->GetDlgItem(IDC_BUTTON6)->EnableWindow(FALSE);
						EMSTOP = false;
					}
				}
			}
			else
			{
				MessageBox(L"使能时数据读取异常！");
				return;
			}
			HICON m_hIcon = AfxGetApp()->LoadIcon(IDI_ICONGREEN);
			((CStatic*)GetDlgItem(IDC_EN_STA_STATIC))->SetIcon(m_hIcon);
			SetDlgItemText(IDC_EN_STATIC, L"Enable Status:ON");
			EMSTOP = false;
		}
		else if (enableflag)
		{
			Ret = PLC->Bit_Reset(ModbusTCP::TcpClient::PlcMemory::DQ, 2048, 0); //设置PLC M0线圈置位
			if (Ret != 0)
			{
				MessageBox(L"关闭使能故障1！");
				return;
			}
			Ret = PLC->CmdRead(ModbusTCP::TcpClient::PlcMemory::HR, ModbusTCP::TcpClient::DataType::INT16, 4096, 1, bRD); //读PLC D0的数据，1515表示正常
			if (Ret == 0)
			{
				StrReg = bRD[0]->ToString();
				if (StrReg != "1010")
				{
					MessageBox(L"关闭使能故障2！");
					return;
				}
				m_Encontrol.SetColor(BLACK, LLTGRAY);
				this->GetDlgItem(IDC_BUTTON6)->EnableWindow(FALSE);
				this->GetDlgItem(IDC_LockBUTTON)->EnableWindow(FALSE);
				this->GetDlgItem(IDC_BUTTON13)->EnableWindow(FALSE);
				this->GetDlgItem(IDC_RESETBUTTON)->EnableWindow(FALSE);
				this->GetDlgItem(IDC_BUTTON10)->EnableWindow(FALSE);
				SetDlgItemText(IDC_EnBUTTON, L"Open En");
				enableflag = false;
			}
			else
			{
				MessageBox(L"关闭使能数据读取异常！");
				return;
			}
			HICON m_hIcon = AfxGetApp()->LoadIcon(IDI_ICONGRAY);
			((CStatic*)GetDlgItem(IDC_EN_STA_STATIC))->SetIcon(m_hIcon);
			SetDlgItemText(IDC_EN_STATIC, L"Enable Status : OFF");
		}
		delete bRD;
		delete StrReg;
	}
	else
	{
		MessageBox(L"PLC未连接，请重新连接系统后重试");
		//m_btnEnable.SetColor(BLACK, LLTGRAY);
		enableflag = false;
	}

}


void CSTC1Dlg::OnBnClickedLockbutton()//滑轨解锁
{
	Double NUM, NUM2;
	GetDlgItemText(IDC_RAZ360EDIT, str);
	NUM = _wtof(str.GetBuffer());
	str.Format(L"%.2f", m_dof.FromDOFBuf.nDOFStatus);
	NUM2 = _wtof(str.GetBuffer());
	if (NUM == -90 && (NUM2 == 255 || NUM2 == 55))
	{

	}
	else if (NUM != -90)
	{
		AfxMessageBox(_T("make sure ISO=0°"));
		return;
	}
	else if (m_dof.FromDOFBuf.nDOFStatus != 55)
	{
		AfxMessageBox(_T("make sure chair At the lowest position!"));
		return;
	}
	if (IDYES == MessageBox(_T("Determine to unlock the Rail?"), _T("提示"), MB_YESNO))
	{
		if (EthLinkOK)
		{
			cli::array<Object ^>^ bRD = gcnew cli::array<Object ^>(1);
			String^ StrReg = gcnew String("");
			if (lockflag)
			{
				Ret = PLC->Bit_Set(ModbusTCP::TcpClient::PlcMemory::DQ, 2049, 0); //设置PLC M1线圈置位
				if (Ret != 0)
				{
					MessageBox(L"解锁故障！");
					return;
				}

				Ret = PLC->CmdRead(ModbusTCP::TcpClient::PlcMemory::HR, ModbusTCP::TcpClient::DataType::INT16, 4097, 1, bRD); //读PLC D1的数据
				if (Ret == 0)
				{
					StrReg = bRD[0]->ToString();
					if (StrReg != "2525")
					{
						Ret = PLC->Bit_Reset(ModbusTCP::TcpClient::PlcMemory::DQ, 2049, 0);
					}
					else
					{
						//m_btnLock.SetColor(BLACK, GREEN);
						lockflag = false;
						m_Lockcontrol.SetColor(BLACK, RED);
					}
				}
				else
				{
					MessageBox(L"解锁数据读取异常！");
					return;
				}
			}
			delete bRD;
			delete StrReg;
		}
		else
		{
			MessageBox(L"PLC未连接");
		}
	}
}

void CSTC1Dlg::CtrlSpeed()
{

	for (int i = 0; i < 6; i++)
	{
		if (i < 3)
		{
			single_move_speed_show[i] = 1;//运动速度赋值
		}
		else
		{
			single_move_speed_show[i] = 10;
		}
	}
	float num[6];
	float time[6];
	maxtime = 0;
	for (size_t i = 0; i < 6; i++)
	{
		num[i] = abs(speed[i] - attitude.mid[i]);
		time[i] = num[i] / single_move_speed_show[i];
	}
	
	for (size_t i = 0; i < 6; i++)
	{
		if (time[i]>maxtime)
		{
			maxtime = time[i];
		}
	}
	for (size_t i = 0; i < 3; i++)
	{
		single_move_speed_show[i] =  num[i] / maxtime;
		if (single_move_speed_show[i]<0.1)
		{
			single_move_speed_show[i] = 0.1;
		}
	}
	for (size_t i = 3; i < 6; i++)
	{
		single_move_speed_show[i] = num[i] / maxtime;
		if (single_move_speed_show[i] <2)
		{
			single_move_speed_show[i] = 2;
		}
	}
}

void CSTC1Dlg::ChangeUI()
{
	m_editFont.CreateFont(
		32,                        // nHeight
		0,                         // nWidth
		0,                         // nEscapement
		0,                         // nOrientation
		FW_NORMAL,                 // nWeight
		FALSE,                     // bItalic
		FALSE,                     // bUnderline
		0,                         // cStrikeOut
		ANSI_CHARSET,              // nCharSet
		OUT_DEFAULT_PRECIS,        // nOutPrecision
		CLIP_DEFAULT_PRECIS,       // nClipPrecision
		DEFAULT_QUALITY,           // nQuality
		DEFAULT_PITCH | FF_SWISS, // nPitchAndFamily
		_T("Arial"));                 // lpszFacename
	m_mainui.GetDlgItem(IDC_AXEDIT2)->SetFont(&m_editFont);
	m_mainui.GetDlgItem(IDC_AYEDIT2)->SetFont(&m_editFont);
	m_mainui.GetDlgItem(IDC_AZEDIT2)->SetFont(&m_editFont);
	m_mainui.GetDlgItem(IDC_RXEDIT2)->SetFont(&m_editFont);
	m_mainui.GetDlgItem(IDC_RYEDIT2)->SetFont(&m_editFont);
	m_mainui.GetDlgItem(IDC_RZEDIT2)->SetFont(&m_editFont);
	m_mainui.GetDlgItem(IDC_XEDIT2)->SetFont(&m_editFont);
	m_mainui.GetDlgItem(IDC_YEDIT2)->SetFont(&m_editFont);
	m_mainui.GetDlgItem(IDC_ZEDIT2)->SetFont(&m_editFont);
	m_mainui.GetDlgItem(IDC_RAXEDIT2)->SetFont(&m_editFont);
	m_mainui.GetDlgItem(IDC_RAYEDIT2)->SetFont(&m_editFont);
	m_mainui.GetDlgItem(IDC_RAZEDIT2)->SetFont(&m_editFont);
	m_mainui.GetDlgItem(IDC_360EDIT)->SetFont(&m_editFont);
	m_mainui.GetDlgItem(IDC_360EDIT2)->SetFont(&m_editFont);
	m_mainui.GetDlgItem(IDC_patientIDEDIT)->SetFont(&m_editFont);
	m_editFont.CreateFont(
		20,                        // nHeight
		0,                         // nWidth
		0,                         // nEscapement
		0,                         // nOrientation
		FW_NORMAL,                 // nWeight
		FALSE,                     // bItalic
		FALSE,                     // bUnderline
		0,                         // cStrikeOut
		ANSI_CHARSET,              // nCharSet
		OUT_DEFAULT_PRECIS,        // nOutPrecision
		CLIP_DEFAULT_PRECIS,       // nClipPrecision
		DEFAULT_QUALITY,           // nQuality
		DEFAULT_PITCH | FF_SWISS, // nPitchAndFamily
		_T("Arial"));
	m_mainui.GetDlgItem(IDC_STATICActual)->SetFont(&m_editFont);
	m_mainui.GetDlgItem(IDC_STATICPlanned)->SetFont(&m_editFont);
	m_mainui.GetDlgItem(IDC_STATIC10)->SetFont(&m_editFont);
	m_mainui.GetDlgItem(IDC_STATIC11)->SetFont(&m_editFont);
	m_mainui.GetDlgItem(IDC_STATIC12)->SetFont(&m_editFont);
	m_mainui.GetDlgItem(IDC_STATICActual2)->SetFont(&m_editFont);
	m_mainui.GetDlgItem(IDC_STATICPlanned2)->SetFont(&m_editFont);
	m_mainui.GetDlgItem(IDC_STATIC13)->SetFont(&m_editFont);
	m_mainui.GetDlgItem(IDC_STATIC14)->SetFont(&m_editFont);
	m_mainui.GetDlgItem(IDC_STATIC15)->SetFont(&m_editFont);
	
	
	//m_mainui.GetDlgItem(IDC_workflowSTATIC)->SetFont(&m_editFont);
	m_cali.GetDlgItem(IDC_QASTATIC)->SetFont(&m_editFont);
	m_corr.GetDlgItem(IDC_SETTINGSSTATIC)->SetFont(&m_editFont);


	m_editFont.CreateFont(
		18,                        // nHeight
		0,                         // nWidth
		0,                         // nEscapement
		0,                         // nOrientation
		FW_NORMAL,                 // nWeight
		FALSE,                     // bItalic
		FALSE,                     // bUnderline
		0,                         // cStrikeOut
		ANSI_CHARSET,              // nCharSet
		OUT_DEFAULT_PRECIS,        // nOutPrecision
		CLIP_DEFAULT_PRECIS,       // nClipPrecision
		DEFAULT_QUALITY,           // nQuality
		DEFAULT_PITCH | FF_SWISS, // nPitchAndFamily
		_T("Arial"));

	GetDlgItem(IDC_STARTBUTTON)->SetFont(&m_editFont);
	GetDlgItem(IDC_EnBUTTON)->SetFont(&m_editFont);
	GetDlgItem(IDC_LockBUTTON)->SetFont(&m_editFont);
	GetDlgItem(IDC_BUTTON6)->SetFont(&m_editFont);
	GetDlgItem(IDC_StepOnBUTTON)->SetFont(&m_editFont);
	GetDlgItem(IDC_RESETBUTTON)->SetFont(&m_editFont);
	GetDlgItem(IDC_BUTTON10)->SetFont(&m_editFont);
	GetDlgItem(IDC_EStopBUTTON)->SetFont(&m_editFont);
	m_mainui.GetDlgItem(IDC_UPBUTTON)->SetFont(&m_editFont);
	m_mainui.GetDlgItem(IDC_DOWNBUTTON)->SetFont(&m_editFont);
	m_mainui.GetDlgItem(IDC_TREATMODEBUTTON)->SetFont(&m_editFont);
	m_mainui.GetDlgItem(IDC_ALIGNERBUTTON)->SetFont(&m_editFont);
	m_mainui.GetDlgItem(IDC_TREATFINISHBUTTON)->SetFont(&m_editFont);
		m_mainui.GetDlgItem(IDC_PLANCOMBO)->SetFont(&m_editFont);

	m_editFont.CreateFont(
		16,                        // nHeight
		0,                         // nWidth
		0,                         // nEscapement
		0,                         // nOrientation
		FW_NORMAL,                 // nWeight
		FALSE,                     // bItalic
		FALSE,                     // bUnderline
		0,                         // cStrikeOut
		ANSI_CHARSET,              // nCharSet
		OUT_DEFAULT_PRECIS,        // nOutPrecision
		CLIP_DEFAULT_PRECIS,       // nClipPrecision
		DEFAULT_QUALITY,           // nQuality
		DEFAULT_PITCH | FF_SWISS, // nPitchAndFamily
		_T("Arial"));
	m_mainui.GetDlgItem(IDC_patientname)->SetFont(&m_editFont);
	m_mainui.GetDlgItem(IDC_patientid)->SetFont(&m_editFont);
	m_mainui.GetDlgItem(IDC_patientsex)->SetFont(&m_editFont);
	m_mainui.GetDlgItem(IDC_patientbirth)->SetFont(&m_editFont);
	m_mainui.GetDlgItem(IDC_COMMLIST)->SetFont(&m_editFont);
	m_mainui.GetDlgItem(IDC_STATIC16)->SetFont(&m_editFont);
	m_mainui.GetDlgItem(IDC_STATIC17)->SetFont(&m_editFont);

