AlanYANG0916/STC/STC1/STC1Dlg.cpp
	//m_corr.onclick
	m_cali.PostMessage(WM_COMMAND, MAKEWPARAM(IDC_BUTTON9, BN_CLICKED), NULL);

}


void CSTC1Dlg::OnTimer(UINT_PTR nIDEvent)
{
	// TODO:  在此添加消息处理程序代码和/或调用默认值

	switch (nIDEvent)
	{
	case 0:					//实时读PLC内存数据
							//timerout();
		break;
	case 1:
		RealAgleRealTime();
		break;
	case 2:
		ActionTip();
		break;
	case 3:
		break;
	case 4:
		break;
	case 5:
		break;
	case 6:
		break;
	case 7:
		break;
	default:
		break;
	}
	CDialogEx::OnTimer(nIDEvent);
}

void CSTC1Dlg::RealAgleRealTime()
{
	cli::array<Object ^>^ bRD = gcnew cli::array<Object ^>(1);
	//cli::array<Object ^>^ bRD2 = gcnew cli::array<Object ^>(1);
	String^ StrRegH = gcnew String("");
	String^ StrRegL = gcnew String("");
	String^ StrReg = gcnew String("");
	CString m_hShiJiJiaoDu;
	//short Ret;
	Ret = PLC->CmdRead(ModbusTCP::TcpClient::PlcMemory::HR, ModbusTCP::TcpClient::DataType::INT16, 5432, 1, bRD);
	if (Ret == 0)
	{
		StrRegL = bRD[0]->ToString();
		CString cstrL(StrRegL);
		CString cstrfloat;
		
		bool Dataflag = false;
		if (cstrL.Left(1) == "-")
		{
			Dataflag = true;
			cstrL.Remove('-');
		}

		int a2 = _ttoi(cstrL);
		int b = a2 % 100;
		a2 = a2 / 100;
		cstrL.Format(_T("%d"), a2);
		cstrfloat.Format(_T("%d"), b);
		if (cstrfloat.Left(1) == "-")
		{
			cstrfloat.Remove('-');
		}
		if (Dataflag)
		{
			m_hShiJiJiaoDu = L"-" + cstrL + "." + cstrfloat;
		}
		else
		{
			m_hShiJiJiaoDu = cstrL + "." + cstrfloat;
		}
		if (LR)
		{
			double NNN = _wtof(m_hShiJiJiaoDu.GetBuffer());
			NNN -= 0.5;
			m_hShiJiJiaoDu.Format(L"%.1f",NNN);
		}

		GetDlgItem(IDC_RAZ360EDIT)->SetWindowText(m_hShiJiJiaoDu);
	}
	
	Ret = PLC->CmdRead(ModbusTCP::TcpClient::PlcMemory::HR, ModbusTCP::TcpClient::DataType::INT16, 4116, 1, bRD); //读PLC D1的数据，1515表示正常
	if (Ret == 0)
	{
		StrRegH = bRD[0]->ToString();
		//float test2 = re_attitude_for_show[5];
		//CString str;
		//CString str2;
		//str2.Format(L"%.6f", test2);
		CString cstrL(StrRegH);
		//SetDlgItemText(IDC_INFOEDIT, cstrL);
		if (cstrL == "1030")
		{
			m_Lockcontrol.SetColor(BLACK, GREEN);
			HICON m_hIcon = AfxGetApp()->LoadIcon(IDI_ICONRED);
			((CStatic*)GetDlgItem(IDC_LOCK_STA_STATIC))->SetIcon(m_hIcon);
			SetDlgItemText(IDC_LOCK_STATIC, L"Track Lock Status:Unlock");
			this->GetDlgItem(IDC_BUTTON6)->EnableWindow(FALSE);
		}
		else if (cstrL == "-1")
		{
			m_Lockcontrol.SetColor(BLACK, LLTGRAY);
			if (lockflag == false)//确保只向一次
			{
				lockflag = true;
				PlaySound(_T("6531.wav"), NULL, SND_FILENAME | SND_ASYNC);
			}		
			HICON m_hIcon = AfxGetApp()->LoadIcon(IDI_ICONGREEN);
			((CStatic*)GetDlgItem(IDC_LOCK_STA_STATIC))->SetIcon(m_hIcon);
			SetDlgItemText(IDC_LOCK_STATIC, L"Track Lock Status:Lock");
			if (enableflag&&m_dof.FromDOFBuf.nDOFStatus==55)
			{
				this->GetDlgItem(IDC_BUTTON6)->EnableWindow(TRUE);
			}		
		}

	}
	//}
	delete bRD;
	//delete bRD2;


	for (int i = 0; i<6; i++)
	{
		re_attitude_for_show[i] = m_dof.FromDOFBuf.motor_code[i];//回传码值
	}
	//码值转换为六维度的分量
	m_dof.FromDOFBuf.motor_code[0] = re_attitude_for_show[4];//userdata.m_eDOF[4];
	m_dof.FromDOFBuf.motor_code[1] = re_attitude_for_show[5];//userdata.m_eDOF[5];
	m_dof.FromDOFBuf.motor_code[2] = re_attitude_for_show[0];
	m_dof.FromDOFBuf.motor_code[3] = re_attitude_for_show[1];
	m_dof.FromDOFBuf.motor_code[4] = re_attitude_for_show[2];//userdata.m_eDOF[2];
	m_dof.FromDOFBuf.motor_code[5] = re_attitude_for_show[3];//userdata.m_eDOF[3];

															 //解码
	SoluteAttitude(m_dof.FromDOFBuf.motor_code, re_attitude_for_show);
	//补偿，校正返回值的误差

	//后三位需要乘以1000
	for (int i = 3; i < 6; i++)
	{
		re_attitude_for_show[i] = re_attitude_for_show[i] * 1000;
	}
	GetRealData(re_attitude_for_show);//校正差值
	//将数值显示
	str.Format(L"%.2f", re_attitude_for_show[0]); this->SetDlgItemTextW(IDC_RXEDIT, str); m_cali.SetDlgItemTextW(IDC_RXEDIT3, str);
	str.Format(L"%.2f", re_attitude_for_show[1]); this->SetDlgItemTextW(IDC_RYEDIT, str); m_cali.SetDlgItemTextW(IDC_RYEDIT3, str);
	str.Format(L"%.2f", re_attitude_for_show[2]); this->SetDlgItemTextW(IDC_RZEDIT, str); m_cali.SetDlgItemTextW(IDC_RZEDIT3, str);
	str.Format(L"%.2f", re_attitude_for_show[3]); this->SetDlgItemTextW(IDC_RAXEDIT, str); m_cali.SetDlgItemTextW(IDC_RAXEDIT3, str);
	str.Format(L"%.2f", re_attitude_for_show[4]); this->SetDlgItemTextW(IDC_RAYEDIT, str); m_cali.SetDlgItemTextW(IDC_RAYEDIT3, str);
	str.Format(L"%.2f", re_attitude_for_show[5]); this->SetDlgItemTextW(IDC_RAZEDIT, str); m_cali.SetDlgItemTextW(IDC_RAZEDIT3, str);
	m_cali.SetDlgItemTextW(IDC_RAZ360EDIT2, m_hShiJiJiaoDu);//IDC_RAZ360EDIT3

	//z轴偏移的反解码

	
	double offset[6];
	for (size_t i = 0; i < 6; i++)
	{
		offset[i]=0;
	}

	GetDlgItemText(IDC_AZ360EDIT, str);
	offset[2] = _wtof(str.GetBuffer());
	double reoffset[6]; for (size_t i = 0; i < 6; i++)
	{
		reoffset[i] = 0;
	}
	DWORD dwCopied = 0;
	CString szKeyValue;
	CString m_szFileName = L"./SettingsINI.ini";
	dwCopied = ::GetPrivateProfileString(L"360Correction", L"X", L"", szKeyValue.GetBuffer(MAX_PATH), MAX_PATH, m_szFileName);
	offset[3] = _wtof(szKeyValue.GetBuffer());
	dwCopied = ::GetPrivateProfileString(L"360Correction", L"Y", L"", szKeyValue.GetBuffer(MAX_PATH), MAX_PATH, m_szFileName);
	offset[4] = _wtof(szKeyValue.GetBuffer());
	szKeyValue.ReleaseBuffer();
	if (ChairMode==TreatmentMode)
	{
		translation.CorrectionFor360Zaxis(offset, reoffset);
	}

	double vector2[6];
	float re_attitude_for_show2[6];
	
	for (size_t i = 0; i < 6; i++)
	{
		re_attitude_for_show2[i] = re_attitude_for_show[i]-ref[i]- reoffset[i];
	}

	translation.ReMatrixToSolve(re_attitude_for_show2, vector2);


	if (vector2[0]<0)
	{
		vector2[0] += 360;
	}
	if (vector2[1]<0)
	{
		vector2[1] += 360;
	}

	//CTabCtrl *tab = (CTabCtrl*)GetParent();//获取父窗口即tab控件指针
	//CWnd *cwnd = this->GetWindow(GW_CHILD);//获取第一个子窗口指针，即Page1  

	//CWnd *cwnd1 = cwnd->GetWindow(GW_HWNDNEXT);//获取第一个子窗口后的窗口，即Page2  
	//cwnd->GetDlgItemText(IDC_ZEDIT2, str);//获取Page2上Text控件的值  

	str.Format(L"%.1f", vector2[0]); m_mainui.SetDlgItemTextW(IDC_RXEDIT2, str); if (m_radiogroup2==0)m_cali.SetDlgItemTextW(IDC_RXEDIT3, str);
	{

