AlanYANG0916/STC/STC1/STC1Dlg.cpp
	}
	str.Format(L"%.1f", vector2[1]); m_mainui.SetDlgItemTextW(IDC_RYEDIT2, str); if (m_radiogroup2 == 0)m_cali.SetDlgItemTextW(IDC_RYEDIT3, str);
	vector2[2] += 270;
	CString str2;
	GetDlgItemText(IDC_RAZ360EDIT, str2);
	double n = _wtof(str2.GetBuffer());

	vector2[2] -= n;
	if ((vector2[2]>360))
	{
		vector2[2] -= 360;
		if (abs(vector2[2] - 360)<0.1)
		{
			vector2[2] = 0;
		}
	}

	str.Format(L"%.1f", vector2[2]);	  m_mainui.SetDlgItemTextW(IDC_RZEDIT2, str); if (m_radiogroup2 == 0)m_cali.SetDlgItemTextW(IDC_RZEDIT3, str);
	str.Format(L"%.2f", vector2[3] / 10); m_mainui.SetDlgItemTextW(IDC_RAXEDIT2, str); if (m_radiogroup2 == 0) { str.Format(L"%.2f", vector2[3]); m_cali.SetDlgItemTextW(IDC_RAXEDIT3, str); }
	str.Format(L"%.2f", vector2[4] / 10); m_mainui.SetDlgItemTextW(IDC_RAYEDIT2, str); if (m_radiogroup2 == 0) {str.Format(L"%.2f", vector2[4]); m_cali.SetDlgItemTextW(IDC_RAYEDIT3, str);}
	str.Format(L"%.2f", vector2[5] / 10); m_mainui.SetDlgItemTextW(IDC_RAZEDIT2, str); if (m_radiogroup2 == 0) {str.Format(L"%.2f", vector2[5]); m_cali.SetDlgItemTextW(IDC_RAZEDIT3, str);}
	if (REset)
	{
		//REset = false;
		LR = false;
		CString m_hShiJiJiaoDu;
		double ang = 0;
		GetDlgItem(IDC_RAZ360EDIT)->GetWindowTextW(m_hShiJiJiaoDu);
		//m_hShiJiJiaoDu.Format(_T("4%f"), ang);
		ang = _wtof(m_hShiJiJiaoDu.GetBuffer());
		if (abs(ang - 5.5)<0.6)//当位置ga位于5才能执行归零操作
		{
			if (EthLinkOK)
			{
				cli::array<Object ^>^ bRD = gcnew cli::array<Object ^>(1);
				String^ StrReg = gcnew String("");
				if (enableflag)
				{
					//fangxiang = 0;
					//short Ret = 254;
					Ret = PLC->Bit_Set(ModbusTCP::TcpClient::PlcMemory::DQ, 2050, 0); //设置PLC M2线圈置位
					if (Ret != 0)
					{
						MessageBox(L"座椅归零故障！");
						return;
					}
					else
					{
						REset = false;
					}
					Ret = PLC->CmdRead(ModbusTCP::TcpClient::PlcMemory::HR, ModbusTCP::TcpClient::DataType::INT16, 4098, 1, bRD); //读PLC D2的数据，3535表示正常
					if (Ret == 0)
					{
						StrReg = bRD[0]->ToString();
						if (StrReg != "3535")
						{
							MessageBox(L"座椅归零读取数据故障！");
							return;
						}
						else
						{
							this->SetDlgItemTextW(IDC_AZ360EDIT, L"0");
						}
					}
					else
					{
						MessageBox(L"座椅归零读取数据异常！");
					}
				}
				else
				{
					MessageBox(L"系统未使能！");
				}
				delete bRD;
				delete StrReg;
			}
			else
			{
				MessageBox(L"PLC未连接");
			}
		}
	}
}

CString  CSTC1Dlg::ToHdata(CString Pdata)
{
	INT32 a = _ttoi(Pdata);
	CString str;
	int b = a / 65536;
	if (m_hJueDuiWeiZhi.Left(1) == "-")
	{
		b = b - 1;
	}
	str.Format(_T("%d"), b);
	return str;
}
CString  CSTC1Dlg::ToLdata(CString Pdata)
{
	INT32 a = _ttoi(Pdata);
	if (a > fangxiang)
	{
		fangxiang = a;
		a = a + 50;				//顺转时补偿0.5度
		CString str;
		str.Format(_T("%d"), fangxiang);
		SetDlgItemText(IDC_STATIC3, str);
		if (a != 0)
		{
			LR = true;
		}
	}
	else
	{
		fangxiang = a;
		CString str;
		str.Format(_T("%d"), fangxiang);
		SetDlgItemText(IDC_STATIC3, str);
		LR = false;
	}
	CString str;
	int b = a % 65536;
	str.Format(_T("%d"), b);
	SetDlgItemText(IDC_STATIC2, str);
	return str;

}

void CSTC1Dlg::ActionTip()
{
	JudgeAction();
	if (::GetKeyState(VK_CONTROL) < 0)//按下
	{
		//AfxMessageBox(L"Ctrl 键按下了。");
		if (DoingTreatMoving == 0)
		{
			DoingTreatMoving = 1;
			m_mainui.REOnBnClickedCorrbutton();
		}
	}
	else//未按下
	{
		//AfxMessageBox(L"Ctrl 键没按下。");
		if (DoingTreatMoving==1)
		{
			DoingTreatMoving = 0;
			OnBnClickedEstopbutton();
			Sleep(200);
			OnBnClickedEstopbutton();
		}
	}

	if (IfMoveInPlace[0]==1&& IfMoveInPlace[1] == 1 && IfMoveInPlace[2] == 1 && 
		IfMoveInPlace[3] == 1 && IfMoveInPlace[4] == 1 && IfMoveInPlace[5] == 1)
	{
		HICON m_hIcon = AfxGetApp()->LoadIcon(IDI_ICONGREEN);
		((CStatic*)GetDlgItem(IDC_POSLOCK_STA_STATIC))->SetIcon(m_hIcon);
		SetDlgItemText(IDC_POS_STATIC, L"Postrue Lock Status : Locking");
		KillTimer(2);
		str.Format(L"%.1f", TTS_coordinate_value[0]); m_mainui.SetDlgItemTextW(IDC_XEDIT2, str);
		str.Format(L"%.1f", TTS_coordinate_value[1]); m_mainui.SetDlgItemTextW(IDC_YEDIT2, str);
		double A360Z;
		GetDlgItemText(IDC_AZ360EDIT, str);  A360Z = _wtof(str.GetBuffer());
		double NNN = TTS_coordinate_value[2] - A360Z;
		str.Format(L"%.1f", TTS_coordinate_value[6]); m_mainui.SetDlgItemTextW(IDC_ZEDIT2, str);
		str.Format(L"%.2f", TTS_coordinate_value[3] / 10); m_mainui.SetDlgItemTextW(IDC_AXEDIT2, str);
		str.Format(L"%.2f", TTS_coordinate_value[4] / 10); m_mainui.SetDlgItemTextW(IDC_AYEDIT2, str);
		str.Format(L"%.2f", TTS_coordinate_value[5] / 10); m_mainui.SetDlgItemTextW(IDC_AZEDIT2, str);
		//IsTreatMoving = false;
		DoingTreatMoving = 0;
	}
	else
	{
		//IsTreatMoving = true;
		HICON m_hIcon = AfxGetApp()->LoadIcon(IDI_ICONRED);
		((CStatic*)GetDlgItem(IDC_POSLOCK_STA_STATIC))->SetIcon(m_hIcon);
		SetDlgItemText(IDC_POS_STATIC, L"Postrue Lock Status : Moving");
	}
	
}
void CSTC1Dlg::JudgeAction()
{
	double NBB[7];
	m_mainui.GetDlgItemText(IDC_RXEDIT2, str); NBB[0] = _wtof(str.GetBuffer());
	m_mainui.GetDlgItemText(IDC_RYEDIT2, str); NBB[1] = _wtof(str.GetBuffer());
	m_mainui.GetDlgItemText(IDC_RZEDIT2, str); NBB[2] = _wtof(str.GetBuffer());
	//GetDlgItemText(IDC_RAZ360EDIT, str); NBB[6] = _wtof(str.GetBuffer());
	m_mainui.GetDlgItemText(IDC_RAXEDIT2, str); NBB[3] = _wtof(str.GetBuffer())*10;
	m_mainui.GetDlgItemText(IDC_RAYEDIT2, str); NBB[4] = _wtof(str.GetBuffer())*10;
	m_mainui.GetDlgItemText(IDC_RAZEDIT2, str); NBB[5] = _wtof(str.GetBuffer())*10;
	for (size_t i = 0; i < 6; i++)
	{
		if (i==2)
		{
			if ((abs(NBB[i] - TTS_coordinate_value[6]) < 0.3) || (abs(NBB[i] - 360 - TTS_coordinate_value[6]) < 0.3))
			{
				IfMoveInPlace[i] = 1;
			}
			else { IfMoveInPlace[i] = 0; }
			/*double A360Z;
			GetDlgItemText(IDC_AZ360EDIT, str);  A360Z = _wtof(str.GetBuffer());
			double NNN = TTS_coordinate_value[2] - A360Z;
			if (NNN>360){NNN -= 360;}
			if (NNN<0) { NNN += 360; }
			if(abs(NNN-NBB[2])<0.6)
			{
				IfMoveInPlace[i] = 1;
			}
			else { IfMoveInPlace[i] = 0; }*/
		}
		else {
			if ((abs( NBB[i]- TTS_coordinate_value[i]) < 0.3)|| (abs(NBB[i]-360 - TTS_coordinate_value[i]) < 0.3))
			{
				IfMoveInPlace[i] = 1;
			}
			else { IfMoveInPlace[i] = 0; }
		}
	}
	//return 1;
}


void CSTC1Dlg::OnBnClickedLogoutbutton()
{
	m_tab.SetCurSel(0);
	m_mainui.ShowWindow(true);
	m_cali.ShowWindow(false);
	m_corr.ShowWindow(false);

	CLogin m_login; m_login.CanClose = false;
	//m_login.GetDlgItem(IDCANCEL)->EnableWindow(FALSE);
	if (m_login.DoModal() == IDOK)
	{
		if (permission=="3")
		{
			m_mainui.ShowWindow(true);
			m_cali.ShowWindow(false);
			m_corr.ShowWindow(false);
			this->GetDlgItem(IDC_TAB1)->EnableWindow(TRUE);
		}
		else if (permission == "2")
		{
			this->GetDlgItem(IDC_TAB1)->EnableWindow(TRUE);
		}
		else if (permission == "1")
		{
			m_mainui.ShowWindow(true);
			m_cali.ShowWindow(false);
			m_corr.ShowWindow(false);
			this->GetDlgItem(IDC_TAB1)->EnableWindow(FALSE);
		}
		SetWindowText(L"RCTS v0.2   UserName: " + UserName + "  Permission: " + permission);
	}
	else
	{
		//CDialogEx::OnCancel();
	}
	//m_login.GetDlgItem(IDCANCEL)->EnableWindow(FALSE);
}

void show_description(HPDF_Page          page,
	HPDF_REAL          x,
	HPDF_REAL          y,
	const char   *text)
{
	float fsize = HPDF_Page_GetCurrentFontSize(page);
	HPDF_Font font = HPDF_Page_GetCurrentFont(page);
	HPDF_RGBColor c = HPDF_Page_GetRGBFill(page);

	HPDF_Page_BeginText(page);
	HPDF_Page_SetRGBFill(page, 0, 0, 0);
	HPDF_Page_SetTextRenderingMode(page, HPDF_FILL);
	HPDF_Page_SetFontAndSize(page, font, 10);
	HPDF_Page_TextOut(page, x, y - 12, text);
	HPDF_Page_EndText(page);

	HPDF_Page_SetFontAndSize(page, font, fsize);
	HPDF_Page_SetRGBFill(page, c.r, c.g, c.b);
}

void CSTC1Dlg::OnBnClickedPdfbutton()
{
	if (PisOpen)//若当前有打开的计划，则加载数据库内的数据
	{
		OnStnClickedEnStatic();
	}
	CString defaultDir = L"A:\\FileTest";   //默认打开的文件路径  
	CString fileName = L"test.pdf";         //默认打开的文件名  
	CString filter = L"文件 (*.pdf)|*.pdf||";   //文件过虑的类型  
	CFileDialog openFileDlg(TRUE, defaultDir, fileName, OFN_HIDEREADONLY | OFN_OVERWRITEPROMPT, filter, NULL);
	//openFileDlg.GetOFN().lpstrInitialDir = L"E:\\FileTest\\test.doc";
	INT_PTR result = openFileDlg.DoModal();
	CString filePath = defaultDir + "\\" + fileName;
	if (result == IDOK) {
		filePath = openFileDlg.GetPathName();

		if (PathFileExists(filePath))
		{
			if (IDYES == MessageBox(_T("The file of the same name already exists,Whether or not covered?"), _T("提示"), MB_YESNO))
			{
			}
			else
			{
				return;
			}
		}
		else
		{
			//return FALSE;
		}
	
