AlanYANG0916/STC/STC1/STC1Dlg.cpp
	}
	else {
		return;
	}

	const wchar_t* wstr = (LPCTSTR)filePath;         //一定得是unicode，否则这句话会错的
	char c[256] = { 0 }; char c1[256] = { 0 };
	wcstombs(c, wstr, wcslen(wstr));
	const char* fname = c;

	const char *page_title = "Chair System Treatment Report";

	HPDF_Doc  pdf;
	HPDF_Font font, font2;
	HPDF_Page page;
	//char fname[256];
	float height = 0; float width = 0;
	int hpos=0;


	//strcpy(fname, "D:\\新建文件夹\\");
	//strcat(fname, "pdftest");
	//strcat(fname, ".pdf");

	pdf = HPDF_New(nullptr, nullptr);
	if (!pdf)
	{
		MessageBox(_T("error: cannot create PdfDoc object\n"));
		return;
	}

	/* set compression mode */
	HPDF_SetCompressionMode(pdf, HPDF_COMP_ALL);
	HPDF_STATUS status;
	HPDF_UseCNSFonts(pdf);
	HPDF_UseCNSEncodings(pdf);
	/* create default-font */
	font = HPDF_GetFont(pdf, "SimHei","GBK-EUC-H");
	font2 = HPDF_GetFont(pdf, "Helvetica", NULL);

	/* add a new page object. */
	page = HPDF_AddPage(pdf);

	status = HPDF_Page_SetFontAndSize(page, font, 30);
	float tw = HPDF_Page_TextWidth(page, page_title);
	status = HPDF_Page_BeginText(page);
	//show_description(page, 60, ypos - 50,
	//"RenderingMode=PDF_STROKE");
	width = HPDF_Page_GetWidth(page); height = HPDF_Page_GetHeight(page);
	HPDF_Page_SetTextRenderingMode(page, HPDF_FILL_CLIPPING);
	hpos = 40;
	status = HPDF_Page_TextOut(page, (width - tw) / 2,height - hpos, page_title);

	status = HPDF_Page_SetFontAndSize(page, font, 20);
	tw = HPDF_Page_TextWidth(page, "SHANGHAI");
	hpos += 30; status = HPDF_Page_TextOut(page, width - tw - 50, height - hpos, "SHANGHAI");

	status = HPDF_Page_SetFontAndSize(page, font, 12);
	tw = HPDF_Page_TextWidth(page, "Shanghai Proton and Heavy Ion Center");
	status = HPDF_Page_TextOut(page, width - tw - 50,height - 85, "Shanghai Proton and Heavy Ion Center");
	tw = HPDF_Page_TextWidth(page, "4365 Kangxin Road, Pudong");
	status = HPDF_Page_TextOut(page, width - tw - 50,height - 100, "4365 Kangxin Road, Pudong");
	tw = HPDF_Page_TextWidth(page, "20171227 Shanghai");
	status = HPDF_Page_TextOut(page, width - tw - 50,height - 115, "20171227 Shanghai");
	tw = HPDF_Page_TextWidth(page, "China");
	status = HPDF_Page_TextOut(page, width - tw - 50,height - 130, "China");

	status = HPDF_Page_TextOut(page, 50,height - 70, "Name           :"); wstr = (LPCTSTR)m_report.PatientName; for (int i = 0; i < 256; i++) { c1[i] = 0; }; wcstombs(c1, wstr, wcslen(wstr)); status = HPDF_Page_TextOut(page, 150, height - 70, c1);
	status = HPDF_Page_TextOut(page, 50,height - 90, "Gender         :"); wstr = (LPCTSTR)m_report.PatientGender; for (int i = 0; i < 256; i++) { c1[i] = 0; }; wcstombs(c1, wstr, wcslen(wstr)); status = HPDF_Page_TextOut(page, 150, height - 90, c1);
	status = HPDF_Page_TextOut(page, 50,height - 110, "Date of birth  :"); wstr = (LPCTSTR)m_report.PatientBirth; for (int i = 0; i < 256; i++) { c1[i] = 0; }; wcstombs(c1, wstr, wcslen(wstr)); status = HPDF_Page_TextOut(page, 150, height - 110, c1);
	status = HPDF_Page_TextOut(page, 50,height - 130, "ID             :"); wstr = (LPCTSTR)m_report.PatientID; for (int i = 0; i < 256; i++) { c1[i] = 0; }; wcstombs(c1, wstr, wcslen(wstr)); status = HPDF_Page_TextOut(page, 150, height - 130, c1);

	status = HPDF_Page_TextOut(page, 50,height - 160, "Fraction sequence  :");
	status = HPDF_Page_TextOut(page, 50,height - 180, "Treatment plan     :"); wstr = (LPCTSTR)m_report.PlanName; for (int i = 0; i < 256; i++) { c1[i] = 0; }; wcstombs(c1, wstr, wcslen(wstr)); status = HPDF_Page_TextOut(page, 200, height - 180, c1);
	status = HPDF_Page_SetFontAndSize(page, font, 10);
	status = HPDF_Page_TextOut(page, 50,height - 190, "----------------------------------------------------------------------------------------------------");
	status = HPDF_Page_TextOut(page, 50, height - 192, "----------------------------------------------------------------------------------------------------");
	
	//m_report.BeamNum=18;
	int P_BeamNum = 0;
	if (m_report.BeamNum>7)
	{
		for (size_t i = 0; i < 8; i++)
		{
			wstr = (LPCTSTR)m_report.BeamName[i]; for (int i = 0; i < 256; i++){c1[i] = 0;}; wcstombs(c1, wstr, wcslen(wstr));
			status = HPDF_Page_TextOut(page, 50, height - 210 - i*70, c1);
			wstr = (LPCTSTR)m_report.BeamTime[i]; for (int i = 0; i < 256; i++){c1[i] = 0;}; wcstombs(c1, wstr, wcslen(wstr));
			status = HPDF_Page_TextOut(page, width / 2, height - 210 - i*70, c1);
			status = HPDF_Page_TextOut(page, 100, height - 225 - i*70, "Lat/Long/Vert[cm]:");
			sprintf(c1, "%.2f(%.2f) / %.2f(%.2f) / %.2f(%.2f)", m_report.PlanBeamInfo[i][3], m_report.ReBeamInfo[i][3], m_report.PlanBeamInfo[i][4], m_report.ReBeamInfo[i][4], m_report.PlanBeamInfo[i][5], m_report.ReBeamInfo[i][5]); 
			status = HPDF_Page_TextOut(page, 250, height - 225 - i*70, c1);
			status = HPDF_Page_TextOut(page, 100, height - 240 - i*70, "Iso/Pitch/Roll[°]:");
			sprintf(c1, "%.2f(%.2f) / %.2f(%.2f) / %.2f(%.2f)", m_report.PlanBeamInfo[i][0], m_report.ReBeamInfo[i][0], m_report.PlanBeamInfo[i][1], m_report.ReBeamInfo[i][1], m_report.PlanBeamInfo[i][2], m_report.ReBeamInfo[i][2]);
			status = HPDF_Page_TextOut(page, 250, height - 240 - i*70, c1);
			status = HPDF_Page_TextOut(page, 100, height - 255 - i*70, "Perm.to treat"); 
			tw = HPDF_Page_TextWidth(page, "Perm.to treat");
			wstr = (LPCTSTR)m_report.BeamOper[i]; for (int i = 0; i < 256; i++){c1[i] = 0;}; wcstombs(c1, wstr, wcslen(wstr));
			status = HPDF_Page_TextOut(page, tw + 110, height - 255 - i*70, c1);
			status = HPDF_Page_TextOut(page, 50, height - 270 - i*70, "----------------------------------------------------------------------------------------------------");
		}		
		P_BeamNum = 7;
		int li= (m_report.BeamNum+2)/ 10;//需要添加的页数
		for (int pi = 0; pi < li; pi++)
		{	
			status = HPDF_Page_EndText(page);
			page = HPDF_AddPage(pdf);
			status = HPDF_Page_BeginText(page);
			status = HPDF_Page_SetFontAndSize(page, font, 12);
			status = HPDF_Page_TextOut(page, 50, height - 50, "----------------------------------------------------------------------------------------------------");
			int lim;
			if (pi == (li-1))
			{
				lim = m_report.BeamNum;
			}
			else 
			{
				lim = P_BeamNum + 10;
			}
			for (size_t i = P_BeamNum; i < lim; i++)
			{
				wstr = (LPCTSTR)m_report.BeamName[i]; for (int i = 0; i < 256; i++){c1[i] = 0;}; wcstombs(c1, wstr, wcslen(wstr));
				status = HPDF_Page_TextOut(page, 50, height - 80 - (i - P_BeamNum) *70, c1);
				wstr = (LPCTSTR)m_report.BeamTime[i]; for (int i = 0; i < 256; i++){c1[i] = 0;}; wcstombs(c1, wstr, wcslen(wstr));
				status = HPDF_Page_TextOut(page, width / 2, height - 80 - (i - P_BeamNum) *70, c1);
				status = HPDF_Page_TextOut(page, 100, height - 95 - (i - P_BeamNum) *70, "Lat/Long/Vert[cm]:");
				sprintf(c1, "%.2f(%.2f) / %.2f(%.2f) / %.2f(%.2f)", m_report.PlanBeamInfo[i][3], m_report.ReBeamInfo[i][3], m_report.PlanBeamInfo[i][4], m_report.ReBeamInfo[i][4], m_report.PlanBeamInfo[i][5], m_report.ReBeamInfo[i][5]);
				status = HPDF_Page_TextOut(page, 250, height - 95 - (i - P_BeamNum) *70, c1);
				status = HPDF_Page_TextOut(page, 100, height - 110 - (i - P_BeamNum) *70, "Iso/Pitch/Roll[°]:");
				sprintf(c1, "%.2f(%.2f) / %.2f(%.2f) / %.2f(%.2f)", m_report.PlanBeamInfo[i][0], m_report.ReBeamInfo[i][0], m_report.PlanBeamInfo[i][1], m_report.ReBeamInfo[i][1], m_report.PlanBeamInfo[i][2], m_report.ReBeamInfo[i][2]);
				status = HPDF_Page_TextOut(page, 250, height - 110 - (i - P_BeamNum) *70, c1);
				status = HPDF_Page_TextOut(page, 100, height - 125 - (i - P_BeamNum) *70, "Perm.to treat");
				tw = HPDF_Page_TextWidth(page, "Perm.to treat");
				wstr = (LPCTSTR)m_report.BeamOper[i]; for (int i = 0; i < 256; i++){c1[i] = 0;}; wcstombs(c1, wstr, wcslen(wstr));
				status = HPDF_Page_TextOut(page, tw + 110, height - 125 - (i - P_BeamNum) *70, c1);
				status = HPDF_Page_TextOut(page, 50, height - 140 - (i - P_BeamNum) *70, "----------------------------------------------------------------------------------------------------");
			
				hpos = height - 150 - (i - P_BeamNum) *70;
			}
			P_BeamNum += 10;		
		}
	}
	else
	{
		for (int i = 0; i <m_report.BeamNum+1; i++)
		{		
			//m_report.BeamName[0] = L"Beam001"; //BeamTime[0] = "20171227"; BeamOper[0] = "1000";
			wstr = (LPCTSTR)m_report.BeamName[i];for (int i = 0; i < 256; i++){c1[i] = 0;};wcstombs(c1, wstr, wcslen(wstr));
			status = HPDF_Page_TextOut(page, 100,height - 210 - i * 70, c1);
			wstr = (LPCTSTR)m_report.BeamTime[i]; for (int i = 0; i < 256; i++){c1[i] = 0;}; wcstombs(c1, wstr, wcslen(wstr));
			status = HPDF_Page_TextOut(page, width / 2,height - 210 - i*70, c1);
			status = HPDF_Page_TextOut(page, 150,height - 225 - i*70, "Lat/Long/Vert[cm]:");
			sprintf(c1, "%.2f(%.2f) / %.2f(%.2f) / %.2f(%.2f)", m_report.PlanBeamInfo[i][3], m_report.ReBeamInfo[i][3], m_report.PlanBeamInfo[i][4], m_report.ReBeamInfo[i][4], m_report.PlanBeamInfo[i][5], m_report.ReBeamInfo[i][5]); 
			status = HPDF_Page_TextOut(page, 300, height - 225 - i*70, c1);
			status = HPDF_Page_TextOut(page, 150,height - 240 - i*70, "Iso/Pitch/Roll[°]:");
			sprintf(c1, "%.2f(%.2f) / %.2f(%.2f) / %.2f(%.2f)", m_report.PlanBeamInfo[i][0], m_report.ReBeamInfo[i][0], m_report.PlanBeamInfo[i][1], m_report.ReBeamInfo[i][1], m_report.PlanBeamInfo[i][2], m_report.ReBeamInfo[i][2]);
			status = HPDF_Page_TextOut(page, 300, height - 240 - i*70, c1);
			status = HPDF_Page_TextOut(page, 100,height - 255 - i*70, "Perm.to treat");
			tw = HPDF_Page_TextWidth(page, "Perm.to treat");
			wstr = (LPCTSTR)m_report.BeamOper[i]; for (int i = 0; i < 256; i++){c1[i] = 0;}; wcstombs(c1, wstr, wcslen(wstr));
			status = HPDF_Page_TextOut(page, tw + 160,height - 255 - i*70, c1);
			status = HPDF_Page_TextOut(page, 50,height - 270 - i*70, "----------------------------------------------------------------------------------------------------");
		}
		hpos = height - 270 - m_report.BeamNum * 70;
		/*if (m_report.BeamNum==2)
		{
			status = HPDF_Page_EndText(page);
			//HPDF_Page page2;
			page = HPDF_AddPage(pdf);
			status = HPDF_Page_BeginText(page);
			status = HPDF_Page_SetFontAndSize(page, font, 12);
			hpos = height -150;
		}*/
		
