AlanYANG0916/STC/STC1/STC1Dlg.cpp
	}

	status = HPDF_Page_TextOut(page, 50, hpos-2, "----------------------------------------------------------------------------------------------------");
	status = HPDF_Page_TextOut(page, 50, hpos - 10, "Fraction :");
	status = HPDF_Page_TextOut(page, width / 3, hpos - 10, "Date :");
	CTime tm; tm = CTime::GetCurrentTime(); 
	int year = tm.GetYear(); int month = tm.GetMonth(); int day = tm.GetDay(); int hour = tm.GetHour(); int minute = tm.GetMinute(); ///分钟
	char time[200];sprintf(time, "%d/%d/%d ", year,month,day);
	status = HPDF_Page_SetFontAndSize(page, font2, 12); HPDF_Page_SetRGBFill(page, 0.2, 0.2, 0.2);
	status = HPDF_Page_TextOut(page, width / 3+35, hpos - 10,time );
	status = HPDF_Page_SetFontAndSize(page, font, 12); HPDF_Page_SetRGBFill(page, 0, 0, 0);
	status = HPDF_Page_TextOut(page, width *2/ 3, hpos - 10, "Room :  Room4");
	status = HPDF_Page_TextOut(page, 50, hpos - 30, "Status :");
	status = HPDF_Page_TextOut(page, width/2, hpos - 30, "Therapist :"); 
	wstr = (LPCTSTR)UserName; for (int i = 0; i < 256; i++) { c1[i] = 0; }; wcstombs(c1, wstr, wcslen(wstr)); status = HPDF_Page_TextOut(page, width / 2+80, hpos - 30, c1);
	//status = HPDF_Page_TextOut(page, 50, hpos - 35, "----------------------------------------------------------------------------------------------------");

	status = HPDF_Page_EndText(page);
	
	/* save the document to a file */
	HPDF_SaveToFile(pdf, fname);
	/* clean up */
	HPDF_Free(pdf);
	MessageBox(_T("Save successful！\n"));
}

void CSTC1Dlg::On32775()
{
	OnBnClickedLogoutbutton();
	//OnBnClickedPdfbutton;
}

void CSTC1Dlg::OnSavereport()
{
	OnBnClickedPdfbutton();
}

void CSTC1Dlg::OnSoftwareinfo()
{
	CAboutDlg dlgAbout;
	dlgAbout.DoModal();
}


void CSTC1Dlg::OnMenuExit()
{
	if (ChairMode == TreatmentMode)
	{
		AfxMessageBox(_T("In treatment mode, if you want to shut down the software, please finish the treatment first."));
		return;
	}
	if (IDYES == MessageBox(_T("Do you want to exit program？Please confirm that the current device is in a safe state"), _T("WARNING!"), MB_YESNO))
	{
		bool canclose = true;
		for (size_t i = 0; i < 6; i++)
		{
			if (abs(re_attitude_for_show[i]) > 1)
			{
				canclose = false;
			}
		}
		if (((m_dof.FromDOFBuf.nDOFStatus != 55) && (!canclose) && EthLinkOK))
		{
			AfxMessageBox(_T("当前治疗椅状态不能关闭！"));
			return;
		}
		CString m_szFileName = L"./SettingsINI.ini";
		CString szKeyValue;
		szKeyValue.Format(L"%.0f", fangxiang);
		::WritePrivateProfileString(L"Open", L"fangxiang", szKeyValue.GetBuffer(MAX_PATH), m_szFileName);
		if (LR)
		{
			szKeyValue.Format(L"%d", 1);
			::WritePrivateProfileString(L"Open", L"LR", szKeyValue.GetBuffer(MAX_PATH), m_szFileName);
		}
		else
		{
			szKeyValue.Format(L"%d", 0);
			::WritePrivateProfileString(L"Open", L"LR", szKeyValue.GetBuffer(MAX_PATH), m_szFileName);
		}
		EthLinkOK = false;
		enableflag = false;
		::timeKillEvent(nMMTimer);
		KillTimer(0);
		KillTimer(1);
		nMMTimer = 0;
		PLC->DeLink();
		CDialogEx::OnCancel();
	}
}


void CSTC1Dlg::OnStnClickedEnStatic()//加载数据库内的治疗数据的函数,在其他函数内保存
{
	mysql_init(&m_sqlCon);//初始化数据库对象
	if (!mysql_real_connect(&m_sqlCon, "localhost", "root", "123456", "chair001", 3306, NULL, 0))//localhost:服务器地址，可以直接填入IP;root:账号;123:密码;test:数据库名;3306:网络端口  
	{
		AfxMessageBox(_T("Database connection failed!"));
		return;
	}
	else//连接成功则继续访问数据库，之后的相关操作代码基本是放在这里面的
	{
		//AfxMessageBox(_T("数据库连接成功!"));
	}
	//查询数据
	/*(mysql_query(&m_sqlCon, "SELECT id FROM patient"));//从users这个表格查询id
	m_res = mysql_store_result(&m_sqlCon);
	while (m_row = mysql_fetch_row(m_res))
	{
		str = m_row[0];
		if (_wtof(m_report.PatientID.GetBuffer()) == _wtof(str.GetBuffer()))
		{
		}
	}*/
	str.Format(L"SELECT TreatTimes FROM treatmentreport where PlanName = \"%s\"", m_report.PlanName);
	const wchar_t* wstr = (LPCTSTR)str;         //一定得是unicode，否则这句话会错的
	char c1[500] = { 0 };
	wcstombs(c1, wstr, wcslen(wstr));
	const char* cc1 = c1;
	mysql_query(&m_sqlCon, cc1);//从users这个表格查询密码"SELECT password FROM users where id = 1000"								//获取结果集
	m_res = mysql_store_result(&m_sqlCon);
	m_row = mysql_fetch_row(m_res);
	str = m_row[0];
	m_report.BeamNum = _wtof(str.GetBuffer())-1;//获取数据库内已治疗过的Beam数据数量
	mysql_close(&m_sqlCon);//关闭Mysql连接
	OnBnClickedButton2();
	//mysql_init(&m_sqlCon);//初始化数据库对象
	/*for (int i = 0; i < m_report.BeamNum; i++)
	{
		str.Format(L"SELECT B%d FROM treatmentreport where PlanName = \"%s\"",i+1, m_report.PlanName);
		wstr = (LPCTSTR)str;         //一定得是unicode，否则这句话会错的
		c1[500] = { 0 };
		wcstombs(c1, wstr, wcslen(wstr));
		cc1 = c1;
		mysql_query(&m_sqlCon, cc1);
		m_res = mysql_store_result(&m_sqlCon);
		m_row = mysql_fetch_row(m_res);
		str = m_row[0]; wstr = (LPCTSTR)str;
		c1[500] = { 0 };
		wcstombs(c1, wstr, wcslen(wstr));
		CString beamdata[14];
		for (int n = 0; n < 14; n++)
		{
			if (c1[n] == 0x2C)//逗号
			{	
				beamdata[n] = result;
				result = L"";
			}
			else
			{
				result += c1[n];
			}
		}
		m_report.ReBeamInfo[i][0] = _wtof(beamdata[0].GetBuffer()); m_report.PlanBeamInfo[i][0] = _wtof(beamdata[1].GetBuffer());
		m_report.ReBeamInfo[i][1] = _wtof(beamdata[2].GetBuffer()); m_report.PlanBeamInfo[i][1] = _wtof(beamdata[3].GetBuffer());
		m_report.ReBeamInfo[i][2] = _wtof(beamdata[4].GetBuffer()); m_report.PlanBeamInfo[i][2] = _wtof(beamdata[5].GetBuffer());
		m_report.ReBeamInfo[i][3] = _wtof(beamdata[6].GetBuffer()); m_report.PlanBeamInfo[i][3] = _wtof(beamdata[7].GetBuffer());
		m_report.ReBeamInfo[i][4] = _wtof(beamdata[8].GetBuffer()); m_report.PlanBeamInfo[i][4] = _wtof(beamdata[9].GetBuffer());
		m_report.ReBeamInfo[i][5] = _wtof(beamdata[10].GetBuffer()); m_report.PlanBeamInfo[i][5] = _wtof(beamdata[11].GetBuffer());
		m_report.BeamOper[i] = beamdata[12]; m_report.BeamTime[i] = beamdata[13];
	}
	mysql_close(&m_sqlCon);//关闭Mysql连接
	*/
}


void CSTC1Dlg::OnEditResetpassword()
{
	CLogin m_login;
	if (m_login.DoModal() == IDOK)
	{

	}
	else
	{
		return;
	}
	LoginSetPass m_login2;
	//m_login2.ChangePass = true;
	if (m_login2.DoModal() == IDOK)
	{
		AfxMessageBox(_T("Reset Password Successful!"));
	}
}


