AlanYANG0916/STC/STC1/STC1Dlg.cpp
void CSTC1Dlg::OnBnClickedButton13()
{
	m_mainui.PostMessage(WM_COMMAND, MAKEWPARAM(IDC_UPBUTTON, BN_CLICKED), NULL);
}

void CSTC1Dlg::OnBnClickedButton2()
{
	CString Result = L"";
	mysql_init(&m_sqlCon);//初始化数据库对象
	if (!mysql_real_connect(&m_sqlCon, "localhost", "root", "123456", "chair001", 3306, NULL, 0))//localhost:服务器地址，可以直接填入IP;root:账号;123:密码;test:数据库名;3306:网络端口  
	{
		AfxMessageBox(_T("Database connection failed!"));
		return;
	}
	for (int i = 0; i < m_report.BeamNum+1; i++)
	{
		str.Format(L"SELECT B%d FROM treatmentreport where PlanName = \"%s\"",i+1, m_report.PlanName);
		const wchar_t* wstr = (LPCTSTR)str;         //一定得是unicode，否则这句话会错的
		char c1[500] = { 0 };
		wcstombs(c1, wstr, wcslen(wstr));
		const char* cc1 = c1;
		mysql_query(&m_sqlCon, cc1);
		m_res = mysql_store_result(&m_sqlCon);
		m_row = mysql_fetch_row(m_res);
		str = m_row[0]; 
		wstr = (LPCTSTR)str;
		c1[500] = { 0 };
		wcstombs(c1, wstr, wcslen(wstr));
		CString beamdata[15];
		int infonum=0;
		for (int n = 0; n < 500; n++)
		{
			if (c1[n] == 0x2C)//逗号
			{
				beamdata[infonum] = Result;
				Result = L"";
				infonum++;
			}
			else
			{
				Result += c1[n];
			}
			if (infonum==15)
			{
				break;
			}
		}
			m_report.PlanBeamInfo[i][0] = _wtof(beamdata[0].GetBuffer()); m_report.ReBeamInfo[i][0] = _wtof(beamdata[1].GetBuffer());
			m_report.PlanBeamInfo[i][1] = _wtof(beamdata[2].GetBuffer()); m_report.ReBeamInfo[i][1] = _wtof(beamdata[3].GetBuffer());
			m_report.PlanBeamInfo[i][2] = _wtof(beamdata[4].GetBuffer()); m_report.ReBeamInfo[i][2] = _wtof(beamdata[5].GetBuffer());
			m_report.PlanBeamInfo[i][3] = _wtof(beamdata[6].GetBuffer()); m_report.ReBeamInfo[i][3] = _wtof(beamdata[7].GetBuffer());
			m_report.PlanBeamInfo[i][4] = _wtof(beamdata[8].GetBuffer()); m_report.ReBeamInfo[i][4] = _wtof(beamdata[9].GetBuffer());
			m_report.PlanBeamInfo[i][5] = _wtof(beamdata[10].GetBuffer()); m_report.ReBeamInfo[i][5] = _wtof(beamdata[11].GetBuffer());
			m_report.BeamName[i] = beamdata[12]; m_report.BeamOper[i] = beamdata[13]; m_report.BeamTime[i] = beamdata[14];
	}
	mysql_close(&m_sqlCon);//关闭Mysql连接
}

void CSTC1Dlg::OnInputpatientAddpatient()//新建病人并添加
{
	AddPatient ADDP;
	if (ADDP.DoModal() == IDOK)
	{

	}
	else
	{}
}


void CSTC1Dlg::OnInputpatientEditpatient()
{
	AddPatient ADDP;
	ADDP.edit = TRUE;
	if (ADDP.DoModal() == IDOK)
	{
	}
	else
	{}
}

void CSTC1Dlg::OnInputplanAddplan()
{
	ADDPLAN ADDP;
	//ADDP.edit = TRUE;
	if (ADDP.DoModal() == IDOK)
	{
	}
	else
	{
	}
}


void CSTC1Dlg::OnInputplanEditplan()
{
	ADDPLAN ADDP;
	ADDP.isedit = TRUE;
	if (ADDP.DoModal() == IDOK)
	{
	}
	else
	{
	}
}


void CSTC1Dlg::OnUserAdduser()
{
	// TODO: 在此添加命令处理程序代码
	ADDUSER ADDP;
	//ADDP.isedit = TRUE;
	if (ADDP.DoModal() == IDOK)
	{
	}
	else
	{
	}
}


void CSTC1Dlg::OnBnClickedmovebeginbutton()
{
	if (ChairMode == TreatmentMode)
	{
		//CtrlSpeed();
		SetTimer(2, 100, NULL);
	}
}

//test
